
Require("CommonScript/BossLeader/BossLeaderDef.lua");

BossLeader.nCrossDayTime = 1; --周一更新数据

BossLeader.tbCrossKinJiFenRank = --跨服积分
{
    [1] = 10;
    [2] = 8;
    [3] = 7;
    [4] = 5;
	[5] = 4;
};
BossLeader.nCanCrossFront = 3; --前几名可以跨服

BossLeader.tbCrossKinDmgRankValue =
{
    ["OpenLevel119"] =
    {
        [-1] = 
        {
            ["Boss"] = 
            {
                [1] = 4000000 * 1.5;
                [2] = 4000000 * 1.5;
                [3] = 4000000 * 1.5;
                [4] = 4000000 * 1.5;
                [5] = 4000000 * 1.5;
            };
            ["FalseBoss"] =
            {
                [1] = 2000000 * 1.5;
                [2] = 2000000 * 1.5;
                [3] = 2000000 * 1.5;
                [4] = 2000000 * 1.5;
                [5] = 2000000 * 1.5;
            }
        };
        [1] =
        {
            ["Boss"] = 
            {
                [1] = 15000000;
                [2] = 15000000;
                [3] = 15000000;
                [4] = 15000000;
                [5] = 15000000;
            };
            ["FalseBoss"] =
            {
                [1] = 7500000;
                [2] = 7500000;
                [3] = 7500000;
                [4] = 7500000;
                [5] = 7500000;
            }
        };
        [2] =
        {
            ["Boss"] = 
            {
                [1] = 20000000;
                [2] = 20000000;
                [3] = 20000000;
                [4] = 20000000;
                [5] = 20000000;
            };
            ["FalseBoss"] =
            {
                [1] = 10000000;
                [2] = 10000000;
                [3] = 10000000;
                [4] = 10000000;
                [5] = 10000000;
            }
        };
    };
}


BossLeader.tbEndJiFenCrossKinMail =
{
    szTitle = "跨服歷代名將資格獲取";
    szContent = 
[[
      恭喜俠士，您所在的幫派[FFFE0D]%s[-]于普通歷代名將中表現優異，戰績超群！現已獲得跨服歷代名將的參與資格。此次跨服歷代名將的開啟時間為[FFFE0D]%s[-]，請你務必準時參加，攜手幫派兄弟再拔頭籌，奪取更加豐厚的獎勵！
]];
}

BossLeader.szEndJiFenKinNotice = "恭喜本幫派在普通歷代名將中表現優異，戰績超群！現已獲得跨服歷代名將的參與資格，可喜可賀！#49"; 
BossLeader.szEndJiFenWorldNotice = "恭喜本服幫派[FFFE0D]%s[-]在普通歷代名將中表現優異，戰績超群！現已獲得跨服歷代名將的參與資格，可喜可賀！"; 


