
local tb    = {
    cj_pg1 = --藏剑剑法--普攻1式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,60},{20,90},{30,130},{32,140}}},
		attack_metaldamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,500*0.95},{32,600*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,500*1.05},{32,600*1.05}}
			},	
		state_hurt_attack={{{1,40},{20,40},{30,40},{32,40}},{{1,4},{20,4},{30,4},{32,4}}},	
		state_npcknock_attack={100,7,25},	
		spe_knock_param={6 , 4, 9},

    }, 
    cj_pg2 = --藏剑剑法--普攻2式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,60},{20,90},{30,130},{32,140}}},
		attack_metaldamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,500*0.95},{32,600*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,500*1.05},{32,600*1.05}}
			},	
		state_hurt_attack={{{1,55},{20,55},{30,55},{32,55}},{{1,4},{20,4},{30,4},{32,4}}},
		
		state_npcknock_attack={100,7,45},	
		spe_knock_param={6 , 4, 9},
    }, 
    cj_pg3 = --藏剑剑法--普攻3式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70},{20,90},{30,140},{32,150}}},
		attack_metaldamage_v={
			[1]={{1,60*1},{20,180*0.95},{30,500*0.95},{32,600*0.95}},
			[3]={{1,60*1},{20,180*1.05},{30,500*1.05},{32,600*1.05}}
			},
		state_hurt_attack={{{1,75},{20,75},{30,75},{32,75}},{{1,5},{20,5},{30,5},{32,5}}},
		
		state_npcknock_attack={100,7,35},	
		spe_knock_param={6 , 4, 9},
	
    }, 	
    cj_pg4 = --藏剑剑法--普攻4式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,90},{20,140},{30,200},{32,220}}},
		attack_metaldamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,600*0.95},{32,700*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,600*1.05},{32,700*1.05}}
			},
		state_hurt_attack={{{1,100},{20,100},{30,100},{32,100}},{{1,5},{20,5},{30,5},{32,5}}},
		
		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
		spe_knock_param1={1},
    }, 
    cj_pg5 = --藏剑剑法--普攻5式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,90},{20,140},{30,200},{32,220}}},
		attack_metaldamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,600*0.95},{32,700*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,600*1.05},{32,700*1.05}}
			},
		state_hurt_attack={{{1,100},{20,100},{30,100},{32,100}},{{1,5},{20,5},{30,5},{32,5}}},
		
		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
		spe_knock_param1={1},
    }, 
    cj_jxmy = --九溪弥烟--1级主动1--15级
    { 
		attack_usebasedamage_p={{{1,150},{15,300},{16,310},{21,380}}},
		attack_metaldamage_v={
			[1]={{1,150*0.95},{15,600*0.95},{16,650*0.95},{21,800*0.95}},
			[3]={{1,150*1.05},{15,600*1.05},{16,650*1.05},{21,800*1.05}}
			},
		state_fixed_attack={0,0},  --秘籍需要用到
		state_npcknock_attack={100,7,35},
		spe_knock_param={6 , 4, 9},
		spe_knock_param1={1},
    },
	cj_phdy = --平湖断月--4级主动2--15级
    { 
		userdesc_000={4409},
    },
    cj_phdy_child = --平湖断月_子--15级
    { 
		attack_usebasedamage_p={{{1,150},{15,240},{16,246},{21,276}}},
		attack_metaldamage_v={
			[1]={{1,200*0.9},{15,700*0.9},{16,735*0.9},{21,910*0.9}},
			[3]={{1,200*1.1},{15,700*1.1},{16,735*1.1},{21,910*1.1}}
			},
		state_fixed_attack={0,0},  --秘籍需要用到	
		state_npcknock_attack={100,7,35},	
		spe_knock_param={6 , 4, 9},
		spe_knock_param1={1},
    },
    cj_xj = --心剑-10级主动3--15级
    {
		autoskill={131,{{1,1},{10,10},{11,11}}},	
		userdesc_000={4411},	
		skill_statetime={{{1,15*15},{15,15*15},{16,15*15},{21,15*15}}},
		userdesc_101={{{1,15*15},{15,15*15},{16,15*15},{21,15*15}}},		--描述用，心剑buff存活时间
		userdesc_102={{{1,15*10},{15,15*10},{16,15*10},{21,15*10}}},		--描述用，攻击buff存活时间
    },
    cj_xj_child = --心剑_子--15级
    {
		physics_potentialdamage_p={{{1,10},{15,40},{16,42},{21,60}}},
		superposemagic={{{1,3},{15,6},{16,6},{21,6}}},						--叠加层数
		skill_statetime={{{1,15*10},{15,15*10},{16,15*10},{21,15*10}}},	
    },
    cj_jt = --惊涛-20级被动1--10级
    {
		physics_potentialdamage_p={{{1,35},{10,50},{11,52}}},
		attackspeed_v={{{1,1},{10,30},{11,33}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
	cj_fcyj = --峰插云景--30级主动4--15级
    { 
		userdesc_000={4415},
		userdesc_101={{{1,30},{10,60},{15,80},{16,85},{20,110},{21,120}}},     			--内圈伤害描述，要与cj_fcyj_child1一样
		userdesc_102={																	--内圈伤害描述，要与cj_fcyj_child1一样
			[1]={{1,70*0.9},{10,200*0.9},{15,245*0.9},{16,260*0.9},{21,500*0.9}},
			[3]={{1,70*1.1},{10,200*1.1},{15,245*1.1},{16,260*1.1},{21,500*1.1}}
			},
		forbid_jump={1},
		skill_statetime={8},
		skill_mintimepercast_v={{{1,45*15},{15,40*15},{16,40*15},{21,40*15}}},
    },
    cj_fcyj_child1 = --峰插云景_内圈伤害
    { 
		attack_usebasedamage_p={{{1,30},{10,60},{15,80},{16,85},{20,110},{21,120}}},
		attack_metaldamage_v={
			[1]={{1,70*0.9},{10,200*0.9},{15,245*0.9},{16,260*0.9},{21,500*0.9}},
			[3]={{1,70*1.1},{10,200*1.1},{15,245*1.1},{16,260*1.1},{21,500*1.1}}
			},	
		flag_attack_npc={{{1,15*15},{15,15*15},{16,15*15},{21,15*15}}},   --对击中的目标进行标记，该标记只有自己能看到
		missile_hitcount={{{1,6},{15,6},{16,6},{21,6}}},
    },
    cj_fcyj_child2 = --峰插云景_外圈伤害
    { 
		attack_usebasedamage_p={{{1,180},{15,210},{16,212},{21,222}}},
		attack_metaldamage_v={
			[1]={{1,300*1},{15,450*0.95},{16,460*0.95},{21,510*0.95}},
			[3]={{1,300*1},{15,450*1.05},{16,460*1.05},{21,510*1.05}}
			},
		flag_attack_npc={{{1,15*15},{15,15*15},{16,15*15},{21,15*15}}},   --对击中的目标进行标记，该标记只有自己能看到
		state_fixed_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*2},{15,15*2},{16,15*2},{21,15*2}}},
    },
    cj_hggs = --鹤归孤山-40级被动2（光环）--10级
    {
		add_mult_proc_sate1={4418,{{1,6},{10,6},{11,6}},60},  --技能ID,叠加层数，自身为圆心格子半径
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
		userdesc_000={4419},							--描述用，对应cj_hggs_enemy
		userdesc_101={{{1,2},{10,20},{11,22}}},			--增加自身攻击力的描述，要与cj_hggs_self数值一致
    },
    cj_hggs_self = --鹤归孤山_自身--10级
    {
		skill_mult_relation={1}, --对应的NPC类型，从skillsetting.ini上查看
		physics_potentialdamage_p={{{1,2},{10,20},{11,22}}},
		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},	
    },
    cj_hggs_enemy = --鹤归孤山_敌人--10级
    {
		physics_potentialdamage_p={{{1,-10},{10,-60},{11,-65}}},	--减少基础攻击力	
		add_dottype_wood_p={1,{{1,-1},{10,-5},{11,-5}}},			--参数1：跟五毒skill_dot_ext_type定义的类型一样，参数2：减少毒伤的%
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},		
    },
    cj_gjjf = --高级剑法-50级被动3--10级
    {
		add_skill_level={4401,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={4402,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={4403,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={4404,{{1,1},{10,10},{11,11}},0},
		userdesc_000={4421},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cj_gjjf_child = --高级剑法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    { 
		attack_attackrate_v={{{1,6},{10,60},{11,66}}},
		attack_usebasedamage_p={{{1,3},{10,30},{11,34}}},
		attack_metaldamage_v={
			[1]={{1,12*1},{10,120},{11,135}},
			[3]={{1,12*1},{10,120},{11,135}}
			},
    }, 
    cj_ybsl = --映波锁澜-60级被动4--10级
    { 
		addstartskill={4410,4423,{{1,1},{10,10},{11,11}}},
		userdesc_000={4432},
		userdesc_101={{{1,15*1},{10,15*3},{11,15*3}}},		--描述用：debuff存在时间的描述，需跟cj_ybsl_child3的时间一致
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cj_ybsl_child1 = --映波锁澜_子1
    { 
		add_hitskill1={4401,4432,{{1,1},{10,10},{11,11}}},		--add_hitskill属性不够4个，所以分开两个BUFF
		add_hitskill2={4402,4432,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,15*15},{10,15*15},{11,15*15}}},	--此时间需跟[心剑]时间一致
    },
    cj_ybsl_child2 = --映波锁澜_子2
    { 
		add_hitskill1={4403,4432,{{1,1},{10,10},{11,11}}},
		add_hitskill2={4404,4432,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,15*15},{10,15*15},{11,15*15}}},	--此时间需跟[心剑]时间一致
    },
    cj_ybsl_child3 = --映波锁澜_子3
    {
		runspeed_p={{{1,-1},{10,-15},{11,-18}}},			--减少基础移速%（角色出生基础移速是270，暂时没有其他途径增加基础移速）
		superposemagic={{{1,4},{10,4},{11,4}}},				--叠加层数
		skill_statetime={{{1,15*1},{10,15*3},{11,15*3}}},
    },
    cj_yqs = --云栖松-70级被动5--10级
    {
		autoskill={132,{{1,1},{10,10},{11,11}}},
		userdesc_000={4425,4426},
		userdesc_101={{{1,40},{10,90},{11,95}}},			--描述用，实际触发几率请查看autoskill.tab中的云栖松
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},	--描述用，实际触发间隔请查看autoskill.tab中的云栖松
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cj_yqs_child1  = --云栖松_子1
    {
		attack_usebasedamage_p={{{1,200},{10,290},{11,300}}},
		attack_metaldamage_v={
			[1]={{1,500*0.9},{10,700*0.9},{11,750*0.9}},
			[3]={{1,500*1.1},{10,700*1.1},{11,750*1.1}}
			},
    },
    cj_yqs_child2 = --云栖松_子2
    {
	 	recover_life_p={{{1,1},{10,3},{11,3}},15},
		skill_statetime={{{1,15*2},{10,15*6},{11,15*6}}},
    },
    cj_flws = --风来吴山-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,10},{20,30},{21,31}}},
		lifemax_p={{{1,5},{20,25},{21,26}}},
		attackspeed_v={{{1,10},{20,20},{21,21}}},
		state_hurt_attackrate={{{1,80},{20,200},{21,206}}},
		skill_statetime={{{1,-1},{20,-1},{21,-1}}},
    },
    cj_hltc = --黄龙吐翠-90级被动7--10级
    { 
		autoskill={133,{{1,1},{10,10},{11,11}}},
		userdesc_000={4429},
		userdesc_101={{{1,40},{10,60},{11,60}}},			--触发几率的描述，实际间隔在auto.tab中修改
		userdesc_102={{{1,15*5},{10,15*5},{11,15*5}}},		--触发间隔的描述，实际间隔在auto.tab中修改
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cj_hltc_child = --黄龙吐翠_子
    {
		attack_usebasedamage_p={{{1,150},{10,200},{11,210}}},
		attack_metaldamage_v={
			[1]={{1,300*1},{10,600*0.95},{11,650*0.95}},
			[3]={{1,300*1},{10,600*1.05},{11,650*1.05}}
			},
		missile_hitcount={{{1,6},{10,6},{11,6}}},		
    },
    cj_nq = --藏剑怒气-怒气
    { 
		attack_usebasedamage_p={{{1,300},{30,300}}},
		attack_metaldamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},	
    },
    cj_nq_child1 = --藏剑怒气_子
    { 
		attack_usebasedamage_p={{{1,1000},{30,1000}}},
		attack_metaldamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},
    },
	cj_nq_child2 = --藏剑怒气_免疫
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,15*4},{30,15*4}}},
    },
}

FightSkill:AddMagicData(tb)