
local tb    = {
    cy_pg1 = --翠烟御伞诀1--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,60},{20,80},{30,120},{32,130}}},
		attack_waterdamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_npchurt_attack={100,6},
		missile_hitcount={{{1,2},{20,2},{30,2},{32,2}}},  
    }, 
 
    cy_pg2 = --翠烟御伞诀2--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,60},{20,80},{30,120},{32,130}}},
		attack_waterdamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_npchurt_attack={100,6},
		state_slowall_attack={{{1,30},{20,30},{30,30}},{{1,15*1.5},{20,15*1.5},{30,15*1.5}}},
		missile_hitcount={{{1,2},{20,2},{30,2},{32,2}}},  
    },

    cy_pg3 = --翠烟御伞诀3--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70},{20,90},{30,130},{32,140}}},
		attack_waterdamage_v={
			[1]={{1,60*1},{20,200*0.95},{30,350*0.95},{32,400*0.95}},
			[3]={{1,60*1},{20,200*1.05},{30,350*1.05},{32,400*1.05}}
			},
	--	state_hurt_attack={50,5,0},
		state_slowall_attack={{{1,50},{20,50},{30,50}},{{1,15*1.5},{20,15*1.5},{30,15*1.5}}},
		state_npchurt_attack={100,6},
		missile_hitcount={{{1,3},{20,3},{30,3},{32,3}}},  
    },

    cy_pg4 = --翠烟御伞诀4--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,100},{20,150},{30,200},{32,220}}},
		attack_waterdamage_v={
			[1]={{1,100*1},{20,350*0.95},{30,500*0.95},{32,530*0.95}},
			[3]={{1,100*1},{20,350*1.05},{30,500*1.05},{32,530*1.05}}
			},
		state_slowall_attack={{{1,80},{20,80},{30,80},{32,80}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{32,15*1.5}}},
		state_npchurt_attack={80,6},
		missile_hitcount={{{1,4},{20,4},{30,4},{32,4}}},  
    }, 
    cy_tlxj = --璇玑罗舞-1级主动1--15级			--飞行一次伤害
    { 
		attack_usebasedamage_p={{{1,70},{15,150},{16,170},{21,270}}},
		attack_waterdamage_v={
			[1]={{1,80*0.9},{15,400*0.9},{16,450*0.9},{21,700*0.9}},
			[3]={{1,80*1.1},{15,400*1.1},{16,450*1.1},{21,700*1.1}}
			},
		state_slowall_attack={{{1,50},{20,80},{30,80},{32,80}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{32,15*1.5}}},
		userdesc_000={807},
    },
    cy_tlxj_child1 = --璇玑罗舞_子1--15级		--持续的间隔伤害
    { 
		attack_usebasedamage_p={{{1,70},{15,130},{16,150},{21,250}}},
		attack_waterdamage_v={
			[1]={{1,80*0.9},{15,400*0.9},{16,450*0.9},{21,700*0.9}},
			[3]={{1,80*1.1},{15,400*1.1},{16,450*1.1},{21,700*1.1}}
			},
		state_slowall_attack={0,0},					--几率，持续时间。配合七罗宝伞秘籍所用
    },
    cy_tlxj_child2 = --璇玑罗舞_子2--15级
    { 
		state_knock_attack={100,5,70},				--几率，时间，速度
		state_npcknock_attack={100,5,70},			--几率，时间，速度 
		spe_knock_param={3 , 4, 9},					--停留时间，玩家动作ID，NPC动作ID
    },
    cy_ydlh = --雨打梨花-4级主动2--10级
    { 
		userdesc_000={829},
    },
    cy_ydlh_child1 = --雨打梨花1倍伤害--10级
    { 
		attack_usebasedamage_p={{{1,30},{15,60},{16,70},{21,120}}},
		attack_waterdamage_v={
			[1]={{1,80*0.9},{15,140*0.9},{16,160*0.9},{21,260*0.9}},
			[3]={{1,80*1.1},{15,140*1.1},{16,160*1.1},{21,260*1.1}}
			},
	

		state_slowall_attack={{{1,70},{15,70},{16,70},{21,70}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},
    },    
	cy_ydlh_child2 = --雨打梨花2倍伤害--10级
    { 
	
		attack_usebasedamage_p={{{1,30},{15,60},{16,70},{21,120}}},
		attack_waterdamage_v={
			[1]={{1,80*0.9},{15,140*0.9},{16,160*0.9},{21,260*0.9}},
			[3]={{1,80*1.1},{15,140*1.1},{16,160*1.1},{21,260*1.1}}
			},
			
	--	state_slowall_attack={{{1,70},{15,70}},{{1,15*1},{15,15*1}}},
    },	
	cy_ydlh_child3 = --雨打梨花3倍伤害--10级
    { 
		attack_usebasedamage_p={{{1,30},{15,60},{16,70},{21,120}}},
		attack_waterdamage_v={
			[1]={{1,80*0.9},{15,140*0.9},{16,160*0.9},{21,260*0.9}},
			[3]={{1,80*1.1},{15,140*1.1},{16,160*1.1},{21,260*1.1}}
			},
	
	--	state_slowall_attack={{{1,70},{15,70}},{{1,15*1},{15,15*1}}},
    },
	cy_zh = --召唤啵啵-10级主动3--15级
    { 
		call_npc1={1827, -1, 3},				--NPCid, NPC等级（-1为跟玩家一样），NPC五行
		remove_call_npc={1827},
		userdesc_000={811},
		skill_statetime={{{1,15*15},{15,15*15},{16,15*15},{21,15*15}}},
		skill_mintimepercast_v={{{1,45*15},{15,40*15},{16,40*15},{21,40*15}}},
    },	
	cy_zh_child = --召唤啵啵_子--15级
    { 
	 	callnpc_life={1827,{{1,100},{15,220},{16,240},{21,340}}},			--NPCid，生命值%
	 	callnpc_damage={1827,{{1,50},{15,100},{16,120},{21,220}}},			--NPCid，攻击力%
		skill_statetime={{{1,15*15},{15,15*15},{21,15*15}}},				--持续时间需要跟cy_zh的时间一致
    },
    cy_xm_normal = --啵啵-普攻
    { 
		attack_usebasedamage_p={140},
	--	attack_waterdamage_v={
	--		[1]={{1,200*0.9},{10,200*0.9}},
	--		[3]={{1,200*1.1},{10,200*1.1}}
	--		},
		state_slowall_attack={50,15*1},			--概率，持续时间
		missile_hitcount={{{1,4},{15,4},{16,4}}},  
    },
    cy_xm_chong = --啵啵-冲
    { 
		attack_usebasedamage_p={280},
		state_slowall_attack={100,15*2},
	--	state_knock_attack={100,35,30},
		state_npcknock_attack={100,35,30}, 
		spe_knock_param={26 , 26, 26},	 
    },
	cy_xmmy = --熊猫免疫
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,-1},{30,-1}}},
    },	
    cy_bxqy = --冰心倩影-20级被动1--10级
    { 
		physics_potentialdamage_p={{{1,15},{10,40},{11,50}}},
		lifemax_p={{{1,20},{10,40},{11,42}}},
		runspeed_v={{{1,20},{10,50},{11,53}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cy_bzwy = --冰踪无影-30级主动4--15级
    { 
	 	userdesc_000={817},
		--state_freeze_attack={{{1,10},{10,50}},{{1,15*1},{10,15*1.5}}},
		missile_hitcount={{{1,1},{15,1}}},
    },
    cy_bzwy_child = --冰踪无影_子--15级
    { 
		attack_usebasedamage_p={{{1,260},{15,300},{16,320},{21,420}}},
		attack_waterdamage_v={
			[1]={{1,600*0.9},{15,1000*0.9},{16,1200*0.9},{21,2200*0.9}},
			[3]={{1,600*1.1},{15,1000*1.1},{16,1200*1.1},{21,2200*1.1}}
			},
		state_freeze_attack={{{1,60},{15,100},{16,100},{21,100}},{{1,15*1},{15,15*2},{16,15*2.5},{21,15*2.5}}},
		missile_hitcount={{{1,5},{15,5}}},
    },
    cy_xy = --雪影-40级被动2（光环）--10级
    { 
		runspeed_v={{{1,10},{10,40},{11,43}}},
		all_series_resist_p={{{1,40},{10,100},{11,106}}},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },	
    cy_xy_team = --雪影_队友--10级
    { 
		runspeed_v={{{1,5},{10,20},{11,22}}},
		all_series_resist_p={{{1,20},{10,50},{11,53}}},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    cy_gjysj = --高级御伞诀-50级被动3--10级
    { 
		add_skill_level={801,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={802,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={803,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={804,{{1,1},{10,10},{11,11}},0},
		userdesc_000={821},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},		
    },
    cy_gjysj_child = --高级御伞诀_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-31级）--10级
    { 
		attack_usebasedamage_p={{{1,4},{10,40},{11,44}}},
		attack_waterdamage_v={
			[1]={{1,15*1},{10,150},{11,165}},
			[3]={{1,15*1},{10,150},{11,165}}
			},
    },
    cy_hthb = --护体寒冰-60级被动4--10级
    { 
		autoskill={81,{{1,1},{10,10},{11,11}}},
		melee_dmg_p={{{1,-5},{10,-30},{11,-35}}},			--减少受到的近战普攻伤害%
		userdesc_000={823},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},	
    },
    cy_hthb_child = --护体寒冰_子1--10级
    { 
		state_slowall_attack={{{1,20},{10,60},{11,64}},{{1,15*1},{10,15*2},{11,15*2}}},
    },
    cy_bjyg = --冰肌玉骨-70级被动5--10级
    { 
		autoskill={82,{{1,1},{10,10},{11,11}}},
		userdesc_000={825,826},
		userdesc_101={{{1,40},{10,90},{11,95}}},			--假描述，触发概率，实际触发概率于aotuskill.tab中设置
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},	--假描述，触发间隔，实际触发概率于aotuskill.tab中设置
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},		
    },
    cy_bjyg_child1 = --冰肌玉骨_子1--10级
    { 
		recover_life_p={{{1,3},{10,5},{11,5}},15},
		skill_statetime={{{1,15*2},{10,15*6},{11,15*6}}},
    },
    cy_bjyg_child2 = --冰肌玉骨_子2--10级
    { 
		state_freeze_attack={{{1,100},{10,100},{11,100}},{{1,15*1.5},{10,15*2.5},{11,15*2.5}}},
    },
    cy_bgxx = --冰骨雪心-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,15},{20,40},{21,41}}},
		lifemax_p={{{1,15},{20,35},{21,36}}},
		attackspeed_v={{{1,5},{20,20},{21,21}}},
		state_slowall_attackrate={{{1,80},{20,200},{21,206}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    cy_90_fysx = --浮云散雪-90级被动7--10级
    {
		add_skill_damage_p={{{1,5},{10,20}}},		--增加技能攻击力
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    cy_nq = --翠烟-怒气
    { 
		attack_usebasedamage_p={{{1,300},{10,300}}},
		attack_waterdamage_v={
			[1]={{1,300*0.9},{10,200*0.9},{31,200*0.9}},
			[3]={{1,300*1.1},{10,200*1.1},{31,200*1.1}}
			},		
    },
    cy_nq_child1 = --翠烟-怒气_子1
    { 
		attack_usebasedamage_p={{{1,1000},{10,1000}}},
		attack_waterdamage_v={
			[1]={{1,1000*0.9},{10,2000*0.9},{31,2000*0.9}},
			[3]={{1,1000*1.1},{10,2000*1.1},{31,2000*1.1}}
			},		
    },
    cy_nq_child2 = --翠烟-怒气_子
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,30},{10,30}}},
    },	
}

FightSkill:AddMagicData(tb)