
local tb    = {
    em_pg1 = --峨眉剑法1--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70},{20,90},{30,130},{32,150}}},
		attack_waterdamage_v={
			[1]={{1,40*1},{20,150*0.95},{30,300*0.95},{32,400*0.95}},
			[3]={{1,40*1},{20,150*1.05},{30,300*1.05},{32,400*1.05}}
			},
		state_npchurt_attack={100,6},
		state_slowall_attack={{{1,30},{20,30},{30,30},{32,30}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{32,15*1.5}}},
		missile_hitcount={{{1,2},{20,2},{30,2},{32,2}}},  
    }, 
 
    em_pg2 = --峨眉剑法2--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70},{20,90},{30,140},{32,160}}},
		attack_waterdamage_v={
			[1]={{1,40*1},{20,150*0.95},{30,400*0.95},{32,500*0.95}},
			[3]={{1,40*1},{20,150*1.05},{30,400*1.05},{32,500*1.05}}
			},
		state_npchurt_attack={100,6},
		state_slowall_attack={{{1,50},{20,50},{30,50},{32,50}},{{1,15*1.5},{20,15*1.5},{30,15*1.5},{32,15*1.5}}},
		missile_hitcount={{{1,2},{20,2},{30,2},{32,2}}},  
    },

    em_pg3 = --峨眉剑法3--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,70},{20,90},{30,170},{32,170}}},
		attack_waterdamage_v={
			[1]={{1,40*1},{20,150*0.95},{30,300*0.95},{32,600*0.95}},
			[3]={{1,40*1},{20,150*1.05},{30,300*1.05},{32,600*1.05}}
			},
	--	state_hurt_attack={50,5,0},
		state_slowall_attack={{{1,70},{20,70},{30,70},{32,70}},{{1,15*1.5},{20,15*1.5},{30,15*2},{32,15*2}}},
		state_npchurt_attack={100,6},
		missile_hitcount={{{1,3},{20,3},{30,3},{32,3}}},  
    },

    em_pg4 = --峨眉剑法4--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,100},{20,150},{30,220},{32,240}}},
		attack_waterdamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,800*0.95},{32,1000*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,800*1.05},{32,1000*1.05}}
			},
		state_slowall_attack={{{1,90},{20,90},{30,90},{32,90}},{{1,15*1.5},{20,15*1.5},{30,15*2},{32,15*2}}},
		state_npchurt_attack={80,6},
		missile_hitcount={{{1,4},{20,4},{30,4},{32,4}}},  
    }, 
    em_jhnb = --江海凝波-1级主动1--10级
    { 
		userdesc_000={311},
    },
    em_jhnb_child = --江海凝波_子--10级
    { 
		state_slowall_attack={{{1,30},{15,30},{16,30},{21,40}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*2}}},
		attack_usebasedamage_p={{{1,70},{15,110},{16,120},{20,170},{21,180}}},
		attack_waterdamage_v={
			[1]={{1,80*0.9},{15,400*0.9},{16,440*0.9},{21,800*0.9}},
			[3]={{1,80*1.1},{15,400*1.1},{16,440*1.1},{21,800*1.1}}
			},
    },
    em_twbl = --天舞宝轮-4级主动2--15级
    { 
		vitality_recover_life={{{1,20*2},{15,20*8},{16,20*9},{21,20*12}},15},
		skill_statetime={{{1,20},{15,20},{16,20},{21,20}}},
		userdesc_000={313},
    },
    em_twbl_child1 = --天舞宝轮_子1--15级
    { 
		attack_usebasedamage_p={{{1,30},{10,60},{15,80},{16,85},{20,110},{21,120}}},
		attack_waterdamage_v={
			[1]={{1,70*0.9},{10,200*0.9},{15,245*0.9},{16,260*0.9},{21,500*0.9}},
			[3]={{1,70*1.1},{10,200*1.1},{15,245*1.1},{16,260*1.1},{21,500*1.1}}
			},
		state_slowall_attack={{{1,70},{15,70},{16,70},{21,70}},{{1,15*3},{15,15*3},{16,15*3},{21,15*3}}},
		state_nojump_attack={{{1,60},{15,60},{16,60},{21,60}},{{1,8},{15,8},{16,8},{21,8}}},
		missile_hitcount={{{1,6},{15,6},{16,6},{21,6}}},
    },
    em_twbl_child3 = --天舞宝轮_子3--15级
    { 
		reverse_hide={},
		skill_statetime={{{1,15*2},{15,15*2},{16,15*2},{21,15*2}}},
    },
	em_chpd = --慈航普度-10级主动3--15级
	{ 
	 	userdesc_000={307},
		missile_hitcount={{{1,1},{15,1},{16,1},{21,1}}}, 
		skill_mintimepercast_v={{{1,40*15},{15,30*15},{16,30*15},{21,30*15}}},
	},	
	em_chpd_child = --慈航普度_子--15级
	{ 
	 	vitality_recover_life={{{1,20*5},{15,20*30},{16,20*35},{21,20*47}},15},
		skill_statetime={{{1,15*5},{15,15*5},{16,15*5},{21,15*5}}},
	},
	em_jxtm = --剑心通明-20级被动1--10级
	{ 
	--	attackspeed_v={{{1,10},{30,10}}},
		physics_potentialdamage_p={{{1,24},{10,70},{11,80}}},
		lifemax_p={{{1,45},{10,60},{11,62}}},
		runspeed_v={{{1,20},{10,50},{11,53}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
	},
    em_blns = --白露凝霜-30级主动4--15级
    { 
		attack_usebasedamage_p={{{1,140},{15,220},{16,230},{21,280}}},
		attack_waterdamage_v={
			[1]={{1,300*0.9},{15,800*0.9},{16,900*0.9},{21,1400*0.9}},
			[3]={{1,300*1.1},{15,800*1.1},{16,900*1.1},{21,1400*1.1}}
			},
	--	state_slowall_attack={{{1,40},{15,40}},{{1,15*2},{15,15*2}}},
		missile_hitcount={{{1,3},{15,3},{16,3}}},
    },
    em_blns_child = --白露凝霜_子--15级
    { 
		attack_usebasedamage_p={{{1,140},{15,220},{16,230},{21,280}}},
		attack_waterdamage_v={
			[1]={{1,300*0.9},{15,800*0.9},{16,900*0.9},{21,1400*0.9}},
			[3]={{1,300*1.1},{15,800*1.1},{16,900*1.1},{21,1400*1.1}}
			},
	--	state_slowall_attack={{{1,40},{15,40}},{{1,15*2},{15,15*2}}},
		missile_hitcount={{{1,5},{15,5},{16,5},{21,5}}},
    },
    em_bxys = --冰心云裳-40级被动2--10级
    { 
		weaken_deadlystrike_v={{{1,20},{10,200},{11,220}}},
		weaken_deadlystrike_damage_p={{{1,5},{10,30},{11,33}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},	
    },
    em_gjjf = --剑法进阶-50级被动3--10级
    { 
		addaction_event1={304,324},		--技能304被324替换
		add_skill_level={301,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={302,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={303,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={304,{{1,1},{10,10},{11,11}},0},
		userdesc_000={361},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},		
    },
    em_gjjf_child1 = --剑法进阶_伤害--10级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,100},{20,150},{30,180},{32,186}}},
		attack_waterdamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,420*0.95},{32,444*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,420*1.05},{32,444*1.05}}
			},
		state_slowall_attack={{{1,80},{20,80},{30,80},{32,80}},{{1,15*0.5},{20,15*0.5},{30,15*0.5},{32,15*0.5}}},
		state_npchurt_attack={80,6},
		missile_hitcount={{{1,4},{20,4},{30,4},{32,4}}},  
    },
    em_gjjf_child2 = --高级剑法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-31级）--10级
    { 
		attack_usebasedamage_p={{{1,3},{10,30},{11,33}}},
		attack_waterdamage_v={
			[1]={{1,12*1},{10,120},{11,132}},
			[3]={{1,12*1},{10,120},{11,132}}
			},
    },
    em_fxcy = --佛心慈佑-60级被动4（光环）--10级
    { 
		resist_allseriesstate_rate_v={{{1,20},{10,80},{11,86}}},
		resist_allseriesstate_time_v={{{1,20},{10,80},{11,86}}},
		resist_allspecialstate_rate_v={{{1,20},{10,80},{11,86}}},
		resist_allspecialstate_time_v={{{1,20},{10,80},{11,86}}},
		userdesc_101={{{1,20},{10,80},{11,86}}},					--增加队友光环的描述
		userdesc_102={{{1,20},{10,80},{11,86}}},					--增加队友光环的描述
		userdesc_103={{{1,20},{10,80},{11,86}}},					--增加队友光环的描述
		userdesc_104={{{1,20},{10,80},{11,86}}},					--增加队友光环的描述
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },	
    em_fxcy_team = --佛心慈佑_队友--10级
    { 
		resist_allseriesstate_rate_v={{{1,20},{10,80},{11,90}}},
		resist_allseriesstate_time_v={{{1,20},{10,80},{11,90}}},
		resist_allspecialstate_rate_v={{{1,20},{10,80},{11,90}}},
		resist_allspecialstate_time_v={{{1,20},{10,80},{11,90}}},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    em_mlcz = --绵里藏针-70级被动5--10级
    { 
		autoskill={31,{{1,1},{10,10},{11,11}}},
		userdesc_000={318},
		userdesc_101={{{1,40},{10,90},{11,95}}},					--假描述，触发概率，实际触发概率于aotuskill.tab中设置
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},			--假描述，触发间隔，实际触发概率于aotuskill.tab中设置
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},		
    },
    em_mlcz_child1 = --绵里藏针子1--10级
    { 
		recover_life_p={{{1,3},{10,6},{11,7}},15},	
		skill_statetime={{{1,15*2},{10,15*6},{11,15*7}}},
    },
    em_mlcz_child2 = --绵里藏针_子2--10级
    { 
		state_knock_attack={100,3,80},		
		state_npcknock_attack={100,3,80},	
		spe_knock_param={0 , 9, 9},
		spe_knock_param1={1},
    },
    em_ffwb = --佛法无边-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,40},{20,90},{21,100}}},
		lifemax_p={{{1,5},{20,25},{21,28}}},
		attackspeed_v={{{1,15},{20,50},{21,55}}},
		state_slowall_attackrate={{{1,80},{20,200},{21,220}}},
		skill_statetime={{{1,-1},{20,-1},{21,-1}}},
    },
     em_90_qxps = --清心普善-90级被动7--10级
    { 
		add_hitskill1={312,358,{{1,1},{10,10}}},
		addstartskill={307,359,{{1,1},{10,10}}},
		lifereplenish_p={{{1,2},{10,15},{11,17}}},
		userdesc_000={358},
		userdesc_101={{{1,20*30*0.1},{10,20*30*0.3},{11,20*30*0.33}},15},					--描述用，加慈航普度回复效果
		skill_statetime={{{1,-1},{10,-1}}},	
    },   
    em_90_qxps_child1 = --清心普善_加天舞-90级被动7
    { 
		vitality_recover_life={{{1,20*8*0.1},{10,20*8*0.4},{11,20*8*0.44}},15},
		skill_statetime={{{1,20},{10,20},{11,20}}},
    },
    em_90_qxps_child2 = --清心普善_加慈航-90级被动7
    { 
		vitality_recover_life={{{1,20*30*0.1},{10,20*30*0.3},{11,20*30*0.33}},15},
		skill_statetime={{{1,15*5},{10,15*5},{11,15*5}}},
    },
    em_bphlj = --冰魄红莲劫-怒气
    { 
		state_freeze_attack={{{1,100},{10,100}},{{1,15*5},{10,15*5}}},
		attack_usebasedamage_p={{{1,1000},{10,1000}}},
		attack_waterdamage_v={
			[1]={{1,300*0.9},{10,2000*0.9}},
			[3]={{1,300*1.1},{10,2000*1.1}}
			},
    },
    em_bphlj_child1 = --冰魄红莲劫_子1
    { 
		all_series_resist_v={{{1,-2000},{10,-2000}}},
		skill_statetime={{{1,15*15},{10,15*15}}},
    },
	em_bphlj_child2 = --冰魄红莲劫_子2
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,35},{10,35}}},
    },	
}

FightSkill:AddMagicData(tb)