
local tb    = {
    gb_pg1 = --丐帮棍法1-普攻1式--20级
    { 
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{32,130}}},
		attack_firedamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,300*0.95},{32,400*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,300*1.05},{32,400*1.05}}
			},
		state_npchurt_attack={100,7}, 
		state_palsy_attack={{{1,30},{20,30},{30,30},{32,30}},{{1,4},{20,4},{30,4},{32,4}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    }, 
    gb_pg2 = --丐帮棍法2-普攻2式--20级
    { 
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{32,130}}},
		attack_firedamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,300*0.95},{32,400*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,300*1.05},{32,400*1.05}}
			},
		state_npchurt_attack={100,7},
		state_palsy_attack={{{1,30},{20,30},{30,30},{32,30}},{{1,4},{20,4},{30,4},{32,4}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    }, 
    gb_pg3 = --丐帮棍法3-普攻3式--20级
    {  
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{32,130}}},
		attack_firedamage_v={
			[1]={{1,60*1},{20,180*0.95},{30,350*0.95},{32,400*0.95}},
			[3]={{1,60*1},{20,180*1.05},{30,350*1.05},{32,400*1.05}}
			},
		state_npchurt_attack={100,7},
		state_palsy_attack={{{1,40},{20,40},{30,40},{32,40}},{{1,6},{20,6},{30,6},{32,6}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    }, 
    gb_pg4 = --丐帮棍法4-普攻4式--20级
    {  
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{32,130}}},
		attack_firedamage_v={
			[1]={{1,60*1},{20,180*0.95},{30,350*0.95},{32,400*0.95}},
			[3]={{1,60*1},{20,180*1.05},{30,350*1.05},{32,400*1.05}}
			},
		state_npchurt_attack={100,7},
		state_palsy_attack={{{1,50},{20,50},{30,50},{32,50}},{{1,6},{20,6},{30,6},{32,6}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    },
    gb_pg5 = --丐帮棍法5-普攻5式--20级
    {  
		attack_usebasedamage_p={{{1,90},{20,150},{30,180},{32,186}}},
		attack_firedamage_v={
			[1]={{1,90*1},{20,350*0.95},{30,500*0.95},{32,600*0.95}},
			[3]={{1,90*1},{20,350*1.05},{30,500*1.05},{32,600*1.05}}
			},
		state_npchurt_attack={100,7},
		state_palsy_attack={{{1,100},{20,100},{30,100},{32,100}},{{1,10},{20,10},{30,10},{32,10}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    }, 
    gb_klyh = --亢龙有悔-1级主动1 --15级
    { 
		attack_usebasedamage_p={{{1,160},{15,200},{16,210},{21,260}}},
		attack_firedamage_v={
			[1]={{1,300*0.95},{15,500*0.95},{16,550*0.95},{21,800*0.95}},
			[3]={{1,300*1.05},{15,500*1.05},{16,550*1.05},{21,800*1.05}}
			},
		state_palsy_attack={{{1,5},{15,30},{16,30},{21,30}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},
		skill_point={{{1,200},{7,200},{8,300},{10,300},{11,400},{13,400},{14,400},{15,500},{16,500},{21,500}},{{1,100},{15,100},{16,100},{21,100}}}, 		--参数1/100：叠加次数，参数2/100：每次CD回复的次数
    },
    gb_klg = --困龙功-4级主动2--15级
    { 
		userdesc_000={4209},
    }, 	
    gb_klg_child = --困龙功_子--15级
    { 
		attack_usebasedamage_p={{{1,240},{15,300},{16,310},{21,360}}},
		attack_firedamage_v={
			[1]={{1,500*1},{15,800*0.95},{16,900*0.95},{21,1400*0.95}},
			[3]={{1,500*1},{15,800*1.05},{16,900*1.05},{21,1400*1.05}}
			},
		state_palsy_attack={{{1,50},{15,70},{16,80},{21,80}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*1.5}}},	
		state_fixed_attack={{{1,50},{15,70},{16,80},{21,80}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*1.5}}},	
		state_npchurt_attack={100,10}, 
		missile_hitcount={{{1,6},{15,6},{16,6},{21,6}}},
    }, 
    gb_zdkw = --醉蝶狂舞-10级主动3--15级
    { 
		runspeed_v={{{1,100},{15,200},{16,210},{21,260}}},
		defense_p={{{1,1000},{15,1600},{16,1700},{21,2200}}},
		skill_statetime={{{1,15*8},{15,15*8},{16,15*8},{21,15*8}}},
    },
    gb_hxwy = --化险为夷-20级被动1--10级
    { 
		lifemax_p={{{1,20},{10,40},{11,42}}},
		runspeed_v={{{1,10},{10,30},{11,32}}},
		defense_p={{{1,100},{10,240},{11,245}}},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    gb_lzyy = --龙战于野-30级主动4--15级
    { 
		userdesc_000={4214},
		skill_mintimepercast_v={{{1,45*15},{15,40*15},{16,40*15},{21,40*15}}},
    }, 	
    gb_lzyy_child1 = --龙战于野_子1（群攻）--15级
    { 
		attack_usebasedamage_p={{{1,30},{15,60},{16,62},{21,72}}},
		attack_firedamage_v={
			[1]={{1,100*1},{15,800*0.95},{16,900*0.95},{21,1400*0.95}},
			[3]={{1,100*1},{15,800*1.05},{16,900*1.05},{21,1400*1.05}}
			},
		dotdamage_maxlife_p={{{1,1},{10,3},{15,3},{16,3},{21,3}},15,3000},			--掉血百分比，debuff每间隔帧掉血，每次掉血上限
		state_palsy_attack={{{1,5},{15,20},{16,22},{21,32}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},	
		state_npchurt_attack={100,10}, 
		skill_statetime={{{1,1},{30,1}}},								--debuff持续时间 填的短代表只掉血1次
		missile_hitcount={{{1,5},{15,5},{16,5},{21,5}}},
    }, 
    gb_lzyy_child3 = --龙战于野_子3--15级
    { 
		missile_hitcount={0,0,1},
    },
    gb_lzyy_child4 = --龙战于野_子4（单体）--15级
    { 
		attack_usebasedamage_p={{{1,50},{15,90},{16,95},{21,120}}},
		attack_firedamage_v={
			[1]={{1,200*1},{15,500*0.95},{16,600*0.95},{21,1100*0.95}},
			[3]={{1,200*1},{15,500*1.05},{16,600*1.05},{21,1100*1.05}}
			},
		dotdamage_maxlife_p={{{1,0.5},{10,2},{15,2},{16,2},{21,2}},15,2500},			--掉血百分比，debuff每间隔帧掉血，每次掉血上限
		state_palsy_attack={{{1,5},{15,20},{16,22},{21,32}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},	
		state_npchurt_attack={100,10}, 
		skill_statetime={{{1,1},{30,1}}},								--debuff持续时间 填的短代表只掉血1次
		missile_hitcount={0,0,1},
    }, 
    gb_hbls = --滑不溜手-40级被动2--10级
    {
		add_mult_proc_sate1={4219,{{1,4},{10,6},{11,6}},60},  --技能ID,叠加层数，自身为圆心格子半径
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_000={4219},
    },
    gb_hbls_child = --滑不溜手_子--10级
    {
		skill_mult_relation={1}, 									--对应的NPC类型，从skillsetting.ini上查看
		defense_v={{{1,20},{10,40},{11,50}}},						--每一层增加的属性值，下面的都是
		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},		
    },
    gb_gjgf = --高级棍法-50级被动3--10级
    { 
		add_skill_level={4201,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={4202,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={4203,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={4205,{{1,1},{10,10},{11,11}},0},
		add_att_speed1={4201,{{1,1},{10,10},{11,11}}},				--增加普攻1的攻击速度
		add_att_speed2={4202,{{1,1},{10,10},{11,11}}},				--增加普攻2的攻击速度
		add_att_speed3={4203,{{1,1},{10,10},{11,11}}},				--增加普攻34的攻击速度
		add_att_speed4={4205,{{1,1},{10,10},{11,11}}},				--增加普攻5的攻击速度
		userdesc_000={4221},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},		
    },
    gb_gjgf_child = --高级棍法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    { 
		attack_usebasedamage_p={{{1,3},{10,30},{11,33}}},
		attack_firedamage_v={
			[1]={{1,12},{10,120},{11,132}},
			[3]={{1,12},{10,120},{11,132}}
			},
    },
    gb_ylj = --游龙决-60级被动4--10级
    { 
		autoskill={45,{{1,1},{10,10},{11,11}}},
		userdesc_000={4223,4224},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    gb_ylj_child1 = --游龙决_子1
    {	
		physics_potentialdamage_p={{{1,20},{10,40},{11,40}}},		--闪避后增加攻击
		superposemagic={{{1,2},{10,5},{11,5}}},						--叠加层数
		userdesc_102={{{1,15*5},{10,15*5},{11,15*5}}},				--描述用，游龙决的触发间隔，实际触发间隔请查看autoskill.tab中的游龙决
		userdesc_101={{{1,15*12},{10,15*12},{11,15*12}}},			--描述用，攻击加成的持续时间
		skill_statetime={{{1,15*9},{10,15*9},{11,15*10}}},		--攻击加成的持续时间
    },
    gb_ylj_child2 = --游龙决_子2
    {	
		recover_life_p={{{1,1},{10,3},{11,3}},15},					--闪避后回复生命
		skill_statetime={{{1,1},{10,1},{11,1}}},					--时间填得短，代表只回复一次
    },
    gb_jctq = --金蝉脱壳-70级被动5--10级
    {
		autoskill={46,{{1,1},{10,10},{11,11}}},
		userdesc_000={4226},
		userdesc_101={{{1,40},{10,90},{11,95}}},				--描述用，实际触发几率请查看autoskill.tab中的金蝉脱壳
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},		--描述用，实际触发几率请查看autoskill.tab中的金蝉脱壳			
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    gb_jctq_child = --金蝉脱壳_子--10级
    { 
		ignore_series_state={},							--免疫、清除属性效果
		ignore_abnor_state={},							--免疫、清除负面效果
		autoskill2={47,{{1,1},{10,10},{11,11}}},		--此处触发等级不生效。取的是“醉蝶狂舞”的当前等级	
		skill_statetime={{{1,15*1},{10,15*1},{11,15*1}}},
    },
    gb_txwg = --天下无狗-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,10},{20,30},{21,32}}},
		lifemax_p={{{1,15},{20,35},{21,36}}},
		attackspeed_v={{{1,5},{20,20},{21,21}}},
		state_palsy_attackrate={{{1,80},{20,200},{21,210}}},
		skill_statetime={{{1,-1},{10,-1}}},
    },
	gb_tthr = --偷天换日-90级被动7--10级
    { 
		autoskill={48,{{1,1},{10,10},{11,11}}},
		userdesc_101={{{1,15*10},{10,15*10},{11,15*10}}},		--描述用，触发间隔。实际效果查看autoskill.tab的偷天换日
		userdesc_102={{{1,40},{10,60},{11,62}}},				--描述用，触发几率。实际效果查看autoskill.tab的偷天换日
		userdesc_000={4230},	
		skill_statetime={{{1,-1},{10,-1}}},	
    },  
	gb_tthr_child = --偷天换日_子
    { 
		stealstate_type={100,1,2}, 								--偷取BUFF的几率， 偷取数量， 技能类型索引SkillSetting.ini
		skill_stealstate_time={{{1,15*5},{10,15*5},{11,15*5}}},
    },
    gb_xlsbz = --降龙十八掌-怒气
    {
		attack_usebasedamage_p={{{1,800},{30,800}}},
		attack_firedamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},	
    },
    gb_xlsbz_child = --降龙十八掌_子（免疫）
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,37},{30,37}}},
    },	
}

FightSkill:AddMagicData(tb)