
local tb    = {
    kl_pg1 = --昆仑剑法--普攻1式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,50},{20,80},{30,120},{32,128}}},
		attack_earthdamage_v={
			[1]={{1,30*1},{20,130*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,30*1},{20,130*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_stun_attack={{{1,30},{20,30},{30,30},{32,30}},{{1,4},{20,4},{30,4},{32,4}}},
		state_npcknock_attack={100,7,50},	
		spe_knock_param={6 , 4, 9},
    }, 
    kl_pg2 = --昆仑剑法--普攻2式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,50},{20,80},{30,120},{32,128}}},
		attack_earthdamage_v={
			[1]={{1,30*1},{20,130*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,30*1},{20,130*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_stun_attack={{{1,50},{20,50},{30,50},{32,50}},{{1,4},{20,4},{30,4},{32,4}}},
		state_npcknock_attack={100,7,40},	
		spe_knock_param={6 , 4, 9},	
    }, 
	
    kl_pg3 = --昆仑剑法--普攻3式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,60},{20,80},{30,130},{32,135}}},
		attack_earthdamage_v={
			[1]={{1,60*1},{20,180*0.95},{30,350*0.95},{32,380*0.95}},
			[3]={{1,60*1},{20,180*1.05},{30,350*1.05},{32,380*1.05}}
			},
		state_stun_attack={{{1,70},{20,70},{30,70},{32,70}},{{1,6},{20,6},{30,6},{32,6}}},
		state_npcknock_attack={100,7,40},
		spe_knock_param={6 , 4, 9},	
    }, 	
    kl_pg4 = --昆仑剑法--普攻4式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,80},{20,120},{30,200},{32,220}}},
		attack_earthdamage_v={
			[1]={{1,100*1},{20,300*0.95},{30,500*0.95},{32,530*0.95}},
			[3]={{1,100*1},{20,300*1.05},{30,500*1.05},{32,530*1.05}}
			},
		state_stun_attack={{{1,100},{20,100},{30,100},{32,100}},{{1,10},{20,10},{30,10},{32,10}}},
		spe_knock_param1={1},
		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
    }, 
    kl_xrzl = --仙人指路-1级主动1--15级
    { 
		userdesc_000={4107},			
    }, 
    kl_xrzl_child = --仙人指路_子
    { 
		attack_usebasedamage_p={{{1,200},{15,280},{16,300},{21,400}}},
		attack_earthdamage_v={
			[1]={{1,400*1},{15,1200*1},{16,1500*1},{21,3000*1}},
			[3]={{1,400*1},{15,1200*1},{16,1500*1},{21,3000*1}}
			},
		state_stun_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*1},{15,15*2},{16,15*2.5},{21,15*2.5}}},
		state_npcknock_attack={100,15,20},
		spe_knock_param={9 , 4, 26},		
    },
    kl_hdjz = --混沌剑阵-4级主动2--15级
    { 
		userdesc_000={4109},			
    },  
    kl_hdjz_child = --混沌剑阵_子
    { 
		attack_usebasedamage_p={{{1,15},{15,45},{16,47},{21,57}}},
		attack_earthdamage_v={
			[1]={{1,50*1},{15,200*1},{16,220*1},{21,320*1}},
			[3]={{1,50*1},{15,200*1},{16,220*1},{21,320*1}}
			},
		state_npchurt_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,6},{15,6},{16,6},{21,6}}},
		missile_hitcount={{{1,6},{15,6},{16,6},{21,6}}},
    },     
	kl_xfsl = --啸风三连-10级主动3--15级
    { 
		attack_usebasedamage_p={{{1,100},{15,160},{16,165},{21,190}}},
		attack_earthdamage_v={
			[1]={{1,200*1},{15,500*0.95},{16,550*0.95},{21,800*0.95}},
			[3]={{1,200*1},{15,500*1.05},{16,550*1.05},{21,800*1.05}}
			},
		state_stun_attack={{{1,30},{15,60},{16,65},{21,65}},{{1,15*1},{15,15*2},{16,15*2},{21,15*2}}},
		state_knock_attack={100,7,50},
		state_npcknock_attack={100,7,50},	
		spe_knock_param={6 , 4, 9},
		missile_hitcount={{{1,3},{15,3},{16,3},{21,3}}}, 
		skill_mintimepercast_v={{{1,20*15},{15,18*15},{16,17*15},{21,17*15}}},
    },
    kl_zxcg = --醉仙错骨-20级被动1--10级
    {
		attackspeed_v={{{1,3},{10,30},{11,33}}},
		state_slowall_resistrate={{{1,35},{10,150},{11,165}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
	kl_ldjt = --雷动九天-30级主动4--15级
    { 
		userdesc_000={4113},
		missile_hitcount={1,1,1},	
		attack_usebasedamage_p={{{1,180},{15,260},{16,270},{21,320}}},
		attack_earthdamage_v={
			[1]={{1,300*1},{15,800*1},{16,850*1},{21,1100*1}},
			[3]={{1,300*1},{15,800*1},{16,850*1},{21,1100*1}}
			},
		state_stun_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*1.5},{15,15*2.5},{16,15*2.5},{21,15*2.5}}},
		skill_mintimepercast_v={{{1,45*15},{15,40*15},{16,39*15},{21,39*15}}},
    }, 
	kl_ldjt_child = --雷动九天2轮-30级主动4--15级
    { 
		ms_one_hit_count = {1},															--每次攻击最大数量
		ms_powerwhencol={{{1,40},{15,40},{16,40},{21,40}},{{1,200},{15,200},{16,200},{21,200}}},  		--参数1：每次增加伤害，参数2：增加上限
		attack_usebasedamage_p={{{1,200},{15,280},{16,290},{21,340}}},
		attack_earthdamage_v={
			[1]={{1,300*1},{15,800*1},{16,850*1},{21,1100*1}},
			[3]={{1,300*1},{15,800*1},{16,850*1},{21,1100*1}}
			},
    }, 
    kl_yfx = --御风行-20级被动1--10级
    {
		runspeed_v={{{1,10},{10,40},{11,44}}},
		defense_p={{{1,50},{10,100},{11,110}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    kl_gjjf = --高级剑法-50级被动3--10级
    {
		add_skill_level={4101,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={4102,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={4103,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={4104,{{1,1},{10,10},{11,11}},0},
		state_stun_attackrate={{{1,10},{10,100},{11,110}}},
		userdesc_000={4117},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    kl_gjjf_child = --高级剑法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    { 
		attack_usebasedamage_p={{{1,3},{10,30},{11,34}}},
		attack_earthdamage_v={
			[1]={{1,12},{10,120},{11,135}},
			[3]={{1,12},{10,120},{11,135}}
			},
    }, 
    kl_hyqk = --混元乾坤-60级被动4--10级
    { 
		autoskill={67,{{1,1},{10,10},{11,11}}},
		userdesc_000={4119},	
		userdesc_101={{{1,15*10},{10,15*10},{11,15*10}}},			--描述用，buff持续时间
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    kl_hyqk_child1 = --混元乾坤_增闪避
    {
		defense_v={{{1,100},{10,200},{11,240}}},	
		superposemagic={{{1,3},{10,6},{11,6}}},				--叠加层数
		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},
    },
    kl_hyqk_child2 = --混元乾坤_降闪避
    {
		defense_v={{{1,-100},{10,-200},{11,-240}}},		
		superposemagic={{{1,3},{10,6},{11,6}}},				--叠加层数
		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},
    },
    kl_ylj = --御雷诀-70级被动5--10级
    { 
		autoskill={68,{{1,1},{10,10},{11,11}}},
		userdesc_000={4131},		
		userdesc_101={{{1,40},{10,90},{11,95}}},			--描述用，实际触发几率请查看autoskill.tab中的御雷诀
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},	--描述用，实际触发间隔请查看autoskill.tab中的御雷诀
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    kl_ylj_child = --御雷诀_子
    {
		state_stun_attack={{{1,100},{10,100},{11,100}},{{1,15*1.5},{10,15*3.5},{11,15*4}}},
		missile_hitcount={{{1,6},{10,6},{11,6}}},		
    },
    kl_sakl = --霜傲昆仑-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,15},{20,40},{21,45}}},
		lifemax_p={{{1,10},{20,30},{21,35}}},
		attackspeed_v={{{1,5},{20,20},{21,25}}},
		state_stun_attackrate={{{1,80},{20,200},{21,240}}},
		skill_statetime={{{1,-1},{20,-1},{21,-1}}},
    },
    kl_tqdz = --天清地浊-90级被动7--10级
    {
		add_mult_proc_sate1={4153,{{1,4},{10,6},{11,6}},60},  --技能ID,叠加层数，自身为圆心格子半径
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_000={4153},
    },
    kl_tqdz_child = --天清地浊_子--10级
    {
		skill_mult_relation={1}, 									--对应的NPC类型，从skillsetting.ini上查看
		defense_p={{{1,20},{10,40},{11,50}}},						--每一层增加的属性值，下面的都是
		attackspeed_v={{{1,3},{10,5},{11,5}}},
		state_stun_attackrate={{{1,20},{10,40},{11,50}}},
		state_stun_attacktime={{{1,20},{10,40},{11,50}}},
		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},		
    },
    kl_kxzwf = --昆虚坠无锋_伤害
    { 
		attack_usebasedamage_p={{{1,800},{30,800}}},
		attack_wooddamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},		
    },
    kl_kxzwf_child = --昆虚坠无锋_免疫
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,40},{30,40}}},
    },	
}

FightSkill:AddMagicData(tb)