
local tb    = {
    sl_pg1 = --少林棍法--普攻1式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,60},{20,80},{30,120},{32,128}}},
		attack_metaldamage_v={
			[1]={{1,50*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,50*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_hurt_attack={{{1,40},{20,40},{30,40},{32,40}},{{1,4},{20,4},{30,4},{32,4}}},
		state_npcknock_attack={100,7,25},	
		spe_knock_param={6 , 4, 9},

    }, 
    sl_pg2 = --少林棍法--普攻2式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,50},{20,80},{30,120},{32,128}}},
		attack_metaldamage_v={
			[1]={{1,50*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,50*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_hurt_attack={{{1,50},{20,50},{30,50},{32,50}},{{1,4},{20,4},{30,4},{32,4}}},
		
		state_npcknock_attack={100,7,45},	
		spe_knock_param={6 , 4, 9},
    }, 
	
    sl_pg3 = --少林棍法--普攻3式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,70},{20,85},{30,130},{32,140}}},
		attack_metaldamage_v={
			[1]={{1,80*1},{20,200*0.95},{30,350*0.95},{32,380*0.95}},
			[3]={{1,80*1},{20,200*1.05},{30,350*1.05},{32,380*1.05}}
			},
		state_hurt_attack={{{1,70},{20,70},{30,70},{32,70}},{{1,6},{20,6},{30,6},{32,6}}},
		
		state_npcknock_attack={100,7,35},	
		spe_knock_param={6 , 4, 9},
	
    }, 	
    sl_pg4 = --少林棍法--普攻4式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,90},{20,130},{30,180},{32,190}}},
		attack_metaldamage_v={
			[1]={{1,100*1},{20,350*0.95},{30,500*0.95},{32,530*0.95}},
			[3]={{1,100*1},{20,350*1.05},{30,500*1.05},{32,530*1.05}}
			},
		state_hurt_attack={{{1,100},{20,100},{30,100},{32,100}},{{1,8},{20,8},{30,8},{32,8}}},
		
		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
		spe_knock_param1={1},
    }, 
    sl_xlg = --降龙棍--1级主动1--15级
    { 
		attack_usebasedamage_p={{{1,150},{15,280},{16,290},{21,350}}},
		attack_metaldamage_v={
			[1]={{1,150*0.95},{15,500*0.95},{16,550*0.95},{21,800*0.95}},
			[3]={{1,150*1.05},{15,500*1.05},{16,550*1.05},{21,800*1.05}}
			},
		state_hurt_attack={{{1,30},{15,60},{16,70},{21,70}},{{1,15*1.5},{15,15*2},{16,15*2},{21,15*2}}},

		state_npcknock_attack={100,14,35},			--概率，时间，速度
		spe_knock_param={11 , 4, 26},				--停留时间，玩家动作，npc动作
		spe_knock_param1={1},
    },
    sl_dljgz = --大力金刚指--4级主动2--15级
    { 
		attack_usebasedamage_p={{{1,160},{15,280},{16,288},{21,328}}},
		attack_metaldamage_v={
			[1]={{1,200*0.95},{15,800*0.95},{16,840*0.95},{21,1040*0.95}},
			[3]={{1,200*1.05},{15,800*1.05},{16,840*1.05},{21,1040*1.05}}
			},
		state_hurt_attack={{{1,70},{15,90},{16,91},{21,91}},{{1,15*2},{15,15*2.5},{16,15*2.5},{21,15*2.5}}},				--配合一指禅功秘籍
		state_fixed_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*1.5},{15,15*2.5},{16,15*2.5},{21,15*2.5}}},
		adddamagebydist={{{1,100},{10,100},{16,100},{21,100}},200000,100},					--放大%=(min(（距离-参数3）*参数1，参数2)/1000)%
		state_npcknock_attack={100,7,35},
		missile_hitcount={0,0,1},				--子弹最多打多少人
		spe_knock_param={6 , 4, 9},
		spe_knock_param1={1},
		skill_mintimepercast_v={{{1,25*15},{15,20*15},{16,20*15},{21,20*15}}},
    },
	sl_jgfm = --金刚伏魔-10级主动3--15级
    { 
		defuse_damage={{{1,100},{10,300},{15,450},{16,480},{21,630}},50},
		ignore_abnor_state={},
		ignore_series_state={},
		skill_statetime={{{1,15*15},{15,15*15},{16,15*15},{21,15*15}}},
    },
	sl_jgfm_child = --金刚伏魔_子
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},
    },
    sl_dmwj = --达摩武经-20级被动1--10级
    {
		lifemax_p={{{1,20},{10,60},{11,64}}},
		resist_allseriesstate_rate_v={{{1,50},{10,150},{11,160}}},
		state_zhican_resistrate={{{1,50},{10,150},{11,160}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    sl_seqls = --十二擒龙手--30级主动4--15级
    { 
		attack_usebasedamage_p={{{1,190},{15,230},{16,240},{20,290},{21,300}}},
		attack_metaldamage_v={
			[1]={{1,400*1},{15,800*0.95},{16,900*0.95},{21,1500*0.95}},
			[3]={{1,400*1},{15,800*1.05},{16,900*1.05},{21,1500*1.05}}
			},
		state_drag_attack={{{1,100},{15,100},{16,100},{21,100}},8,70},
		skill_drag_npclen={90},
		state_fixed_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*2},{15,15*2.5},{16,15*2.5},{21,15*2.5}}},
		skill_mintimepercast_v={{{1,35*15},{15,30*15},{16,30*15},{21,30*15}}},
		missile_hitcount={{{1,6},{15,6},{16,6}}},
    },
    sl_lhz = --罗汉阵-40级被动2--10级
    { 
		autoskill={23,{{1,1},{10,10},{11,11}}},
		userdesc_000={274},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    sl_lhz_child = --罗汉阵_子
    {
		attack_usebasedamage_p={{{1,50},{10,90},{11,95}}},
		attack_metaldamage_v={
			[1]={{1,100*1},{10,240*0.95},{11,254*0.95}},
			[3]={{1,100*1},{10,240*1.05},{11,254*1.05}}
			},
		missile_hitcount={{{1,6},{10,6},{11,6}}},		
    },
    sl_gjgf = --高级棍法-50级被动3--10级
    {
		add_skill_level={261,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={262,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={263,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={264,{{1,1},{10,10},{11,11}},0},
		userdesc_000={277},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    sl_gjgf_child = --高级棍法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    { 
		attack_attackrate_v={{{1,6},{10,60},{11,66}}},
		attack_usebasedamage_p={{{1,4},{10,40},{11,44}}},
		attack_metaldamage_v={
			[1]={{1,15*1},{10,150},{11,165}},
			[3]={{1,15*1},{10,150},{11,165}}
			},
    }, 
    sl_ldcf = --立地成佛-60级被动4--10级
    {
		autoskill={25,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_000={279},
    },
    sl_ldcf_child = --立地成佛_子
    {
		all_series_resist_p={{{1,30},{10,50},{11,52}}},
		superposemagic={{{1,8},{10,8},{11,8}}},					--叠加层数
		userdesc_101={{{1,15*5},{10,15*5},{11,15*5}}},			--持续时间的假描述，需要跟下面skill_statetime的参数一样
		skill_statetime={{{1,15*5},{10,15*5},{11,15*5}}},		
    },
    sl_jgnm = --金刚怒目-70级被动5--10级
    { 
		autoskill={24,{{1,1},{10,10},{11,11}}},
		userdesc_000={281},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    sl_jgnm_child = --金刚怒目_子
    {
		all_series_resist_p={{{1,300},{10,500},{11,520}}},
		add_usebasedmg_p1={274,{{1,100},{10,250},{11,265}}},			--增加罗汉阵攻击力
		userdesc_101={{{1,20},{10,60},{11,64}}},						--描述用，实际触发几率请查看autoskill.tab中的金刚怒目
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},              	--描述用，实际触发间隔请查看autoskill.tab中的金刚怒目
		skill_statetime={{{1,15*3},{10,15*5},{11,15*5}}},
    },
    sl_yjj = --易筋经-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,15},{20,50},{21,55}}},
		lifemax_p={{{1,5},{20,25},{21,26}}},
		attackspeed_v={{{1,5},{20,20},{21,21}}},
		state_hurt_attackrate={{{1,80},{20,200},{21,206}}},
		skill_statetime={{{1,-1},{20,-1},{21,-1}}},
    },
    sl_90_lhjs = --罗汉金身-90级被动7--10级
    {  
		autoskill={27,{{1,1},{10,10},{11,11}}},
		userdesc_000={299},
		userdesc_101={{{1,15*6},{10,15*3},{11,15*3}}},			--描述用，触发间隔时间，实际效果查看autoskill.tab中的罗汉金身
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    sl_90_lhjs_child = --罗汉金身_子
    { 
		state_fixed_attack={{{1,30},{10,50},{11,55}},{{1,15*1},{10,15*2.5},{11,15*2}}},
		missile_hitcount={0,0,1}, 
    },
    sl_rysxm = --如影随形灭-怒气
    { 
		userdesc_000={0},	
    },
    sl_rysxm_child1 = --如影随形灭_子1
    { 
		attack_usebasedamage_p={{{1,300},{30,500}}},
		attack_metaldamage_v={
			[1]={{1,100*0.9},{30,200*0.9},{31,200*0.9}},
			[3]={{1,100*1.1},{30,200*1.1},{31,200*1.1}}
			},
    },
    sl_rysxm_child2 = --如影随形灭_子2
    { 
		attack_usebasedamage_p={{{1,1000},{30,1000}}},
		attack_metaldamage_v={
			[1]={{1,1000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,1000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},
    },
	sl_rysxm_child3 = --如影随形灭_子2
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,15*4},{30,15*4}}},
    },
}

FightSkill:AddMagicData(tb)