
local tb    = {
    tm_pg1 = --唐门暗器-普攻1式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,40},{20,70},{30,100},{32,120}}},
		attack_wooddamage_v={
			[1]={{1,30*1},{20,130*0.95},{30,300*0.95},{32,350*0.95}},
			[3]={{1,30*1},{20,130*1.05},{30,300*1.05},{32,350*1.05}}
			},	
		state_npchurt_attack={100,7},
		keephide={},
		missile_hitcount={1,1,1},
    }, 
    tm_pg2 = --唐门暗器-普攻2式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,40},{20,70},{30,110},{32,120}}},
		attack_wooddamage_v={
			[1]={{1,30*1},{20,140*0.95},{30,300*0.95},{32,350*0.95}},
			[3]={{1,30*1},{20,140*1.05},{30,300*1.05},{32,350*1.05}}
			},	
		state_npchurt_attack={100,7},
		keephide={},	
		missile_hitcount={1,1,1},
    }, 
    tm_pg3 = --唐门暗器-普攻3式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,60},{20,80},{30,110},{32,120}}},
		attack_wooddamage_v={
			[1]={{1,60*1},{20,180*0.95},{30,350*0.95},{32,400*0.95}},
			[3]={{1,60*1},{20,180*1.05},{30,350*1.05},{32,400*1.05}}
			},
		state_npchurt_attack={100,7},
		keephide={},
		missile_hitcount={1,1,1},
    }, 
    tm_pg4 = --唐门暗器-普攻4式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,80},{20,130},{30,170},{32,180}}},
		attack_wooddamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,500*0.95},{32,550*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,500*1.05},{32,550*1.05}}
			},
		state_zhican_attack={{{1,40},{20,40},{30,40},{32,40}},{{1,15*0.5},{20,15*0.5},{30,15*0.5},{32,15*0.5}}},
		state_npchurt_attack={100,7},
		keephide={},
		missile_hitcount={1,1,1},
    }, 
    tm_dgc = --缠身刺-1级主动--15级
    { 
		userdesc_000={4007},
		skill_point={{{1,200},{7,200},{8,300},{10,300},{11,400},{13,400},{14,500},{15,600},{16,600},{21,600}},{{1,100},{15,100},{16,100},{21,100}}}, 		--参数1/100：叠加次数，参数2/100：每次CD回复的次数
		skill_maxmissile={{{1,2},{8,3},{15,6},{16,6},{21,6}}},					--最多同时存在的数量
		keephide={},
		missile_hitcount={{{1,3},{15,3},{16,3}}},  
    },
    tm_dgc_child = --缠身刺_子
    { 
		attack_usebasedamage_p={{{1,150},{15,240},{16,250},{21,290}}},
		attack_wooddamage_v={
			[1]={{1,200*0.9},{15,600*0.9},{16,700*0.9},{21,1200*0.9}},
			[3]={{1,200*1.1},{15,600*1.1},{16,700*1.1},{21,1200*1.1}}
			},
		state_zhican_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*1.5}}},
		state_fixed_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*2},{15,15*2.5},{16,15*2.5},{21,15*2.5}}},
    },
    tm_bylh = --暴雨梨花4级主动2--15级
    { 
		skill_point={{{1,100},{6,100},{7,200},{13,200},{14,300},{15,400},{16,400},{21,400}},{{1,100},{15,100},{21,100}}}, 		--参数1/100：叠加次数，参数2/100：每次CD回复的次数
		attack_usebasedamage_p={{{1,150},{15,200},{16,220},{21,320}}},
		attack_wooddamage_v={
			[1]={{1,200*1},{15,600*1},{16,650*1},{21,900*1}},
			[3]={{1,200*1},{15,600*1},{16,650*1},{21,900*1}}
			},
		state_npchurt_attack={100,6},	
		keephide={},
		missile_hitcount={{{1,3},{15,3},{16,3},{21,3}}},
    },	
    tm_bylh_child = --暴雨梨花_散镖
    { 
		attack_usebasedamage_p={{{1,70},{15,100},{16,110},{21,160}}},
		attack_wooddamage_v={
			[1]={{1,100*1},{15,300*1},{16,320*1},{21,420*1}},
			[3]={{1,100*1},{15,300*1},{16,320*1},{21,420*1}}
			},
		state_npchurt_attack={100,6},
		missile_hitcount={{{1,1},{15,1},{16,1},{21,1}}},
    },
	tm_myz = --迷影纵-10级主动3--15级
    { 
		skill_mintimepercast_v={{{1,10*15},{15,7*15},{16,6*15},{21,5*15}}},
		keephide={},
    },
    tm_xp = --心魄-20级被动1--10级
    { 
		miss_remote_rate={{{1,100},{10,1000},{11,1200}}},			--闪避远程攻击万分比
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tm_jgfx = --九宫飞星-30级主动4--15级
    { 
		userdesc_000={4013},	
		keephide={},
		skill_mintimepercast_v={{{1,45*15},{15,35*15},{16,34*15},{21,34*15}}},
    },	
    tm_jgfx_child = --九宫飞星_子
    { 
		attack_usebasedamage_p={{{1,45},{15,65},{16,67},{21,77}}},
		attack_wooddamage_v={
			[1]={{1,200*1},{15,400*1},{16,420*1},{21,520*1}},
			[3]={{1,200*1},{15,400*1},{16,420*1},{21,520*1}}
			},
		state_zhican_attack={{{1,20},{15,20},{16,20},{21,20}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*1.5}}},
		spe_knock_param1={1},
		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
		missile_hitcount={{{1,1},{15,1},{16,1},{21,1}}},
    },
    tm_cds = --淬毒术-40级被动2（光环）--10级
    { 
		physics_potentialdamage_p={{{1,20},{10,40},{11,42}}},
		deadlystrike_damage_p={{{1,5},{10,30},{11,32}}},		
	--	userdesc_101={{{1,10},{10,20},{11,37}}},					--描述用：增加队友攻击力
		userdesc_102={{{1,2},{10,15},{11,16}}},					--描述：用增加队友会心伤害
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },	
    tm_cds_team = --淬毒术_队友--10级
    { 
	--	physics_potentialdamage_p={{{1,15},{10,35},{11,37}}},
		deadlystrike_damage_p={{{1,2},{10,15},{11,16}}},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },	
    tm_gjaq = --高级暗器-50级被动3--10级
    {
		add_skill_level={4001,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={4002,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={4003,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={4004,{{1,1},{10,10},{11,11}},0},
		--addms_speed1={4001,{{1,20},{10,20},{11,20}}},		
		--addms_speed2={4002,{{1,20},{10,20},{11,20}}},		
		--addms_speed3={4003,{{1,20},{10,20},{11,20}}},		 
		--addms_speed4={4004,{{1,20},{10,20},{11,20}}},		
		userdesc_000={4018},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tm_gjaq_child = --高级暗器_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    { 
		attack_usebasedamage_p={{{1,3},{10,30},{11,34}}},
		attack_wooddamage_v={
			[1]={{1,12},{10,120},{11,132}},
			[3]={{1,12},{10,120},{11,132}}
			},	 
    }, 
    tm_xy = --心眼-60级被动4--10级
    { 
		autoskill={54,{{1,1},{10,10},{11,11}}},
		userdesc_000={4020},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tm_xy_child = --心眼_子
    {
		ignore_defense_v={{{1,50},{10,100},{11,105}}},		
		physics_potentialdamage_p={{{1,2},{10,5},{11,5}}},
		superposemagic={{{1,3},{10,8},{11,8}}},				--叠加层数
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    tm_yxhy = --移形换影-70级被动5--10级
    {
		autoskill={55,{{1,1},{10,10},{11,11}}},
		userdesc_000={4029},
		userdesc_101={{{1,40},{10,90},{11,95}}},			--描述用，实际触发几率请查看autoskill.tab中的移形换影
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},	--描述用，实际触发几率请查看autoskill.tab中的移形换影
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tm_yxhy_child1  = --移形换影_隐身--10级
    {
		hide={{{1,15*2},{15,15*2},{16,15*2}},1},				--参数1时间，参数2：队友1，同阵营2
		skill_statetime={{{1,15*2},{10,15*2},{11,15*2}}},
    },
    tm_yxhy_child2  = --移形换影_减CD--10级
    {
		reduce_cd_time1={4010,{{1,15*60},{10,15*60},{11,15*60}}},			--减迷影纵CD
		reduce_cd_time2={4006,{{1,15*5},{10,15*10},{12,15*11}}},			--减毒骨刺CD
		reduce_cd_time3={4008,{{1,15*5},{10,15*10},{12,15*11}}},			--减暴雨梨花CD
		reduce_cd_time4={4012,{{1,15*10},{10,15*20},{12,15*22}}},			--减九宫飞星CD
		skill_statetime={{{1,2},{10,2},{11,2}}},
    },
	tm_yxhy_child3  = --移形换影_分身
    { 
		call_mirror1={1965, 1},				--NPCid, 影子数量
		remove_call_npc={1965},
		skill_statetime={{{1,15*2},{15,15*2},{16,15*2}}},
    },	
	tm_yxhy_child4 = --移形换影_分身buff
    { 
		call_masterlife={1965,{{1,200},{10,200}}},					--NPCid,召唤NPC的血量为召唤者当前血量的%
	 	callnpc_damage={1965,{{1,0},{10,0}}},						--NPCid,攻击力%
		skill_statetime={{{1,15*2},{15,15*2}}},						--持续时间需要跟cy_zh的时间一致
    },
    tm_xm = --心魔-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,15},{20,40},{21,42}}},
		lifemax_p={{{1,15},{20,35},{21,36}}},
		attackspeed_v={{{1,5},{20,20},{21,21}}},
		state_zhican_attackrate={{{1,80},{20,200},{21,206}}},
		skill_statetime={{{1,-1},{20,-1},{21,-1}}},
    },
    tm_zxzd = --追星逐电-90级被动7--10级
    { 
		autoskill={58,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},		
		userdesc_000={4061},		
    },
    tm_zxzd_child = --追星逐电_子-90级被动7--10级
    { 
		state_fixed_attack={{{1,50},{10,80},{11,85}},{{1,15*1},{10,15*2.5},{11,15*2.5}}},
		missile_hitcount={{{1,1},{10,1},{11,1}}},
    },
    tm_qjkql_child1 = --千机孔雀翎_伤害
    { 
		attack_usebasedamage_p={{{1,800},{30,800}}},
		attack_wooddamage_v={
			[1]={{1,2000*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,2000*1.1},{30,2000*1.1},{31,2000*1.1}}
			},		
    },
    tm_qjkql_child2 = --千机孔雀翎_免疫
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,20},{30,20}}},
    },	
}

FightSkill:AddMagicData(tb)