
local tb    = {
    th_pg1 = --桃花箭术1-普攻1式--20级
    { 
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{32,126}}},
		attack_firedamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,270*0.95},{32,294*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,270*1.05},{32,294*1.05}}
			},
		state_npchurt_attack={100,7},
	--	state_hurt_attack={20,15*0.3,0}, 
		missile_hitcount={{{1,2},{20,2},{30,2},{32,2}}},  
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    }, 
    th_pg2 = --桃花箭术2-普攻2式--20级
    { 
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{32,126}}},
		attack_firedamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,270*0.95},{32,294*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,270*1.05},{32,294*1.05}}
			},
		state_npchurt_attack={100,7},
	--	state_hurt_attack={40,4,0}, 
		missile_hitcount={{{1,2},{20,2},{30,2},{32,2}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    }, 
    th_pg3 = --桃花箭术3-普攻3式--20级
    {  
		attack_usebasedamage_p={{{1,60},{20,90},{30,120},{32,126}}},
		attack_firedamage_v={
			[1]={{1,60*1},{20,180*0.95},{30,300*0.95},{32,324*0.95}},
			[3]={{1,60*1},{20,180*1.05},{30,300*1.05},{32,324*1.05}}
			},
		state_npchurt_attack={100,7},
	--	state_hurt_attack={80,5,0},
		missile_hitcount={{{1,3},{20,3},{30,3},{32,3}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    }, 
    th_pg4 = --桃花箭术4-普攻4式--20级
    {  
		attack_usebasedamage_p={{{1,90},{20,150},{30,180},{32,186}}},
		attack_firedamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,420*0.95},{32,444*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,420*1.05},{32,444*1.05}}
			},
		state_npchurt_attack={100,7},
		state_palsy_attack={{{1,40},{20,40},{30,40},{32,40}},{{1,15*0.5},{20,15*0.5},{30,15*0.5},{32,15*0.5}}},
		missile_hitcount={{{1,3},{20,3},{30,3},{32,3}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    }, 
    th_fhlx = --飞火流星-1级主动1 --10级
    { 
		attack_usebasedamage_p={{{1,150},{15,260},{16,271},{21,326}}},
		attack_firedamage_v={
			[1]={{1,160*0.95},{15,500*0.95},{16,524*0.95},{21,644*0.95}},
			[3]={{1,160*1.05},{15,500*1.05},{16,524*1.05},{21,644*1.05}}
			},
		state_knock_attack={40,12,30},
		state_npcknock_attack={100,12,30},
		spe_knock_param={9 , 4, 9},
		state_palsy_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*1.5}}},
    },
    th_jylz_root= --九曜连珠-4级主动2--10级
    { 
		userdesc_000={411},
    },
	
    th_jylz = --九曜连珠-10级主动3--10级
    { 
		attack_usebasedamage_p={{{1,40},{15,70},{16,72},{21,82}}},
		attack_firedamage_v={
			[1]={{1,60*0.95},{15,180*0.95},{16,188*0.95},{21,228*0.95}},
			[3]={{1,60*1.05},{15,180*1.05},{16,188*1.05},{21,228*1.05}}
			},
		state_palsy_attack={{{1,10},{15,10},{16,10},{21,10}},{{1,15*0.5},{15,15*0.5},{16,15*0.5},{21,15*0.5}}},
		state_npchurt_attack={100,9},
    },	
    th_hfly = --火凤燎原-10级主动3--15级
    { 
		runspeed_v={{{1,100},{15,200},{16,210},{21,260}}},
		attackspeed_v={{{1,20},{15,50},{16,52},{21,62}}},
		defense_p={{{1,50},{15,100},{16,103},{21,118}}},
		skill_statetime={{{1,15*10},{15,15*10},{16,15*10},{21,15*10}}},
    },
    th_lfhx = --流风回雪-20级被动1--10级
    { 
	--	runspeed_v={{{1,10},{30,50}}},
		physics_potentialdamage_p={{{1,20},{10,50},{11,53}}},
		state_hurt_resistrate={{{1,20},{10,50},{11,53}}},
		skill_statetime={{{1,-1},{10,-1}}},
    },
    th_cypy_root= --穿云破月-30级主动4--15级
	{ 
		userdesc_000={438},
    },
    th_cypy = --穿云破月_伤害--15级
    { 
		attack_usebasedamage_p={{{1,380},{15,440},{16,444},{21,464}}},
		attack_firedamage_v={
			[1]={{1,1000*0.9},{15,1600*0.9},{16,1640*0.9},{21,1840*0.9}},
			[3]={{1,1000*1.1},{15,1600*1.1},{16,1640*1.1},{21,1840*1.1}}
			},
	--	state_palsy_attack={{{1,100},{30,100},{31,100}},{{1,15*1},{30,15*1}}},

	--	state_knock_attack={30,12,30},
		state_npcknock_attack={100,12,30},
		spe_knock_param={9 , 4, 26},
		missile_hitcount={{{1,4},{15,4},{16,4},{21,4}}},
    },
    th_nzjy = --逆转九阴-40级被动2--10级
    { 
		autoskill={42,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_000={444},		
    },
    th_nzjy_child = --逆转九阴_子-40级被动2--10级
    { 
		state_knock_attack={100,3,80},		
		state_npcknock_attack={100,3,80},	
		spe_knock_param={0 , 9, 9},
		userdesc_105={{{1,10},{10,30},{11,32}},{{1,15*3},{10,15*3},{11,15*3}}},		--仅为描述，真实概率与时间于autoskill.tab中设置
    },
    th_gjjs = --百步穿杨-50级被动3--10级
    { 
		addaction_event1={404,421},		--技能404被421替换
		add_skill_level={401,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={402,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={403,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={404,{{1,1},{10,10},{11,11}},0},
		userdesc_000={439},	
		skill_statetime={{{1,-1},{20,-1}}},		
    },
    th_gjjs_child1 = --百步穿杨_伤害--10级
    { 
		attack_usebasedamage_p={{{1,90},{20,150},{30,180},{32,186}}},
		attack_firedamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,420*0.95},{32,444*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,420*1.05},{32,444*1.05}}
			},
		state_npchurt_attack={100,7},
		state_palsy_attack={{{1,40},{20,40},{30,40},{32,40}},{{1,15*0.5},{20,15*0.5},{30,15*0.5},{32,15*0.5}}},
		missile_hitcount={{{1,3},{20,3},{30,3},{32,3}}},
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
    },
    th_gjjs_child2 = --百步穿杨_子2（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    { 
		attack_usebasedamage_p={{{1,3},{10,30},{12,36}}},
		attack_firedamage_v={
			[1]={{1,12},{10,120},{12,144}},
			[3]={{1,12},{10,120},{12,144}}
			},
    },
    th_qyby = --轻云蔽月--60级被动4--10级
    {
		addpowerwhencol={401,{{1,10},{10,30},{11,32},{12,32}},{{1,30},{10,90},{11,96},{12,96}}},				--技能ID，每次增加%，最大增加%
		addpowerwhencol1={402,{{1,10},{10,30},{11,32},{12,32}},{{1,30},{10,90},{11,96},{12,96}}},
		addpowerwhencol2={403,{{1,10},{10,30},{11,32},{12,32}},{{1,30},{10,90},{11,96},{12,96}}},
		addpowerwhencol3={421,{{1,10},{10,30},{11,32},{12,32}},{{1,30},{10,90},{11,96},{12,96}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    th_yhcs = --浴火重生-70级被动5--10级
    {
		autoskill={41,{{1,1},{10,10},{11,11}}},
		userdesc_000={426},
		userdesc_101={{{1,40},{10,90},{11,95}}},			--描述用，实际触发几率请查看autoskill.tab中的浴火重生
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},		--描述用，实际触发几率请查看autoskill.tab中的浴火重生			
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    th_yhcs_child = --浴火重生_子--10级
    { 
	 	recover_life_p={{{1,1},{10,4},{11,4}},15},
		autoskill2={43,{{1,1},{10,10},{11,11}}},		--此处触发等级不生效。取的是“火凤燎原”的当前等级	
		skill_statetime={{{1,15*2},{10,15*3},{11,15*3}}},
    },
    th_fync = --凤羽霓裳-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,10},{20,30},{21,31}}},
		lifemax_p={{{1,15},{20,35},{21,36}}},
		attackspeed_v={{{1,5},{20,20},{21,21}}},
		state_palsy_attackrate={{{1,80},{20,200},{21,206}}},
		skill_statetime={{{1,-1},{10,-1}}},
    },
	th_90_ylxc = --月落星沉-90级被动7--10级
    { 
		autoskill={44,{{1,1},{10,10},{11,11}}},
		userdesc_101={{{1,15*5},{10,15*4},{11,15*4}}},			--描述用，触发间隔。实际时间查看autoskill.tab的月落星沉
		userdesc_102={{{1,100},{10,100},{11,100}}},				--描述用，触发几率。实际几率查看autoskill.tab的月落星沉
		userdesc_000={465},	
		skill_statetime={{{1,-1},{10,-1}}},	
    },  
	th_90_ylxc_child1 = --月落星沉_buff1
    { 
		addstartskill={401,465,{{1,1},{10,10}}},				
		addstartskill2={402,465,{{1,1},{10,10}}},
		skill_statetime={{{1,2},{30,2}}},							--buff持续时间
    },
	th_90_ylxc_child2 = --月落星沉_buff2
    { 
		addstartskill={403,466,{{1,1},{10,10}}},
		addstartskill2={421,466,{{1,1},{10,10}}},
		skill_statetime={{{1,2},{30,2}}},							--buff持续时间
    },
	th_90_ylxc_child3 = --月落星沉_前2式伤害
    { 
		dotdamage_maxlife_p={{{1,10},{10,30},{12,33}},15,30000},		--掉血百分比，debuff每间隔帧掉血，每次掉血上限
		skill_statetime={{{1,1},{30,1}}},								--debuff持续时间 填的短代表只掉血1次
		missile_hitcount={2,2,2}, 		
    },
	th_90_ylxc_child4 = --月落星沉_后2式触发伤害
    { 
		dotdamage_maxlife_p={{{1,10},{10,25},{12,28}},15,30000},		--掉血百分比，debuff每间隔帧掉血，每次掉血上限
		skill_statetime={{{1,1},{30,1}}},							--debuff持续时间 填的短代表只掉血1次
		missile_hitcount={3,3,3}, 		
    },
    th_lhfxy = --落花焚星焱-怒气
    {
		--autoskill={41,{{1,1},{30,10},{31,10}}},
		--skill_statetime={{{1,-1},{30,-1}}},
    },
    th_lhfxy_child1 = --落花焚星焱_子1
    { 
		--ms_randres_id1={25,427},
		--ms_randres_id2={100,428},
		--ms_randres_id3={25,429},
		--ms_randres_id4={25,430},
		attack_usebasedamage_p={{{1,800},{30,800}}},
		attack_firedamage_v={
			[1]={{1,200*0.9},{30,200*0.9},{31,200*0.9}},
			[3]={{1,200*1.1},{30,200*1.1},{31,200*1.1}}
			},		
    },
    th_lhfxy_child2 = --落花焚星焱_子2
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,37},{30,37}}},
    },	
    th_blhq = --碧落黄泉-40级被动2--10级
    { 
		deadlystrike_v={{{1,50},{10,200}}},
		deadlystrike_damage_p={{{1,5},{10,20}}},	
		skill_statetime={{{1,15*3},{10,15*3}}},		
    },
    th_blhq_team = --碧落黄泉_队友--10级
    { 
		deadlystrike_v={{{1,25},{10,100}}},
		deadlystrike_damage_p={{{1,2},{10,10}}},	
		skill_statetime={{{1,15*3},{10,15*3}}},
    },
}

FightSkill:AddMagicData(tb)