
local tb    = {
    tw_xyj = --行云诀--普攻1式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,50},{20,80},{30,120},{32,128}}},
		attack_metaldamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_hurt_attack={{{1,40},{20,40},{30,40},{32,40}},{{1,4},{20,4},{30,4},{32,4}}},	
		state_npcknock_attack={100,7,25},	
		spe_knock_param={6 , 4, 9},

    }, 
    tw_jlj = --惊雷诀--普攻2式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,50},{20,80},{30,120},{32,128}}},
		attack_metaldamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,300*0.95},{32,330*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,300*1.05},{32,330*1.05}}
			},
		state_hurt_attack={{{1,55},{20,55},{30,55},{32,55}},{{1,4},{20,4},{30,4},{32,4}}},
		
		state_npcknock_attack={100,7,45},	
		spe_knock_param={6 , 4, 9},
    }, 
	
    tw_xlj = --降龙诀--普攻3式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,60},{20,80},{30,130},{32,135}}},
		attack_metaldamage_v={
			[1]={{1,60*1},{20,180*0.95},{30,350*0.95},{32,384*0.95}},
			[3]={{1,60*1},{20,180*1.05},{30,350*1.05},{32,384*1.05}}
			},
		state_hurt_attack={{{1,75},{20,75},{30,75},{32,75}},{{1,5},{20,5},{30,5},{32,5}}},
		
		state_npcknock_attack={100,7,35},	
		spe_knock_param={6 , 4, 9},
	
    }, 	
    tw_ptj = --破天诀--普攻4式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,160},{32,172}}},
		attack_usebasedamage_p={{{1,80},{20,120},{30,180},{32,192}}},
		attack_metaldamage_v={
			[1]={{1,90*1},{20,300*0.95},{30,500*0.95},{32,540*0.95}},
			[3]={{1,90*1},{20,300*1.05},{30,500*1.05},{32,540*1.05}}
			},
		state_hurt_attack={{{1,100},{20,100},{30,100},{32,100}},{{1,5},{20,5},{30,5},{32,5}}},
		
		state_npcknock_attack={100,14,30},
		spe_knock_param={11 , 4, 26},
		spe_knock_param1={1},
    }, 
	tw_ymcz = --野蛮冲撞--1级主动1--15级
    { 
		userdesc_000={207},
    },
    tw_ymcz_child = --野蛮冲撞_子--15级
    { 
		attack_usebasedamage_p={{{1,130},{15,210},{16,215},{21,240}}},
		attack_metaldamage_v={
			[1]={{1,150*0.95},{15,600*0.95},{16,630*0.95},{21,900*0.95}},
			[3]={{1,150*1.05},{15,600*1.05},{16,630*1.05},{21,900*1.05}}
			},
		state_fixed_attack={{{1,100},{15,100},{16,100},{21,100}},{{1,15*1},{15,15*1},{16,15*1.5},{21,15*2}}},
		state_knock_attack={100,7,35},		
		state_npcknock_attack={100,7,35},	
		spe_knock_param={6 , 4, 9},
		spe_knock_param1={1},
    },
    tw_xzbf = --血战八方--4级主动2--15级
    {
		userdesc_000={211, 228},
		skill_mintimepercast_v={{{1,35*15},{15,25*15},{16,25*15},{21,25*15}}},
    },
    tw_xzbf_child1 = --血战八方_子1--15级
    { 
		attack_usebasedamage_p={{{1,50},{15,70},{16,73},{21,90}}},
		attack_metaldamage_v={
			[1]={{1,70*0.95},{15,300*0.95},{16,320*0.95},{21,500*0.95}},
			[3]={{1,70*1.05},{15,300*1.05},{16,320*1.05},{21,500*1.05}}
			},
		state_npcknock_attack={100,7,30},	
		spe_knock_param={6 , 4, 9},		
    },
    tw_xzbf_child2 = --血战八方_子2--15级
    { 
		ignore_series_state={},	
		ignore_abnor_state={},	
		ignore_skillstate1={4451},
		ignore_skillstate2={4458},			
		ignore_skillstate3={4432},			
		skill_statetime={{{1,15*7},{15,15*7},{16,15*7},{21,15*7}}},
    },
    tw_xzbf_child3 = --血战八方_子3--15级
    {
		add_mult_proc_sate2={228,{{1,1},{15,1},{16,1},{21,1}},60},  --技能ID,叠加层数，自身为圆心格子半径
		skill_statetime={{{1,15*10},{15,15*10},{16,15*10},{21,15*10}}},
    },
    tw_xzbf_child4 = --血战八方_子4--15级
    {
		skill_mult_relation={1}, --对应的NPC类型，从skillsetting.ini上查看
		add_skill_damage_p={{{1,1},{15,1},{16,1},{21,1}}},
		skill_statetime={{{1,15*3},{15,15*3},{16,15*3},{21,15*3}}},		
    },
	tw_dmxy = --金钟罩-10级主动3--15级
    { 
		all_series_resist_p={{{1,200},{15,300},{16,306},{21,336}}},
		recover_life_v={{{1,100},{15,500},{16,526},{21,700}},15*5},
		all_series_resist_v={{{1,50},{15,200},{16,210},{21,260}}},
		resist_allseriesstate_rate_v={{{1,35},{15,150},{16,158},{21,200}}},
		skill_statetime={{{1,15*15},{15,15*15},{16,15*15},{21,15*15}}},
    },
    tw_twzy = --天王战意-20级被动1--10级
    {
		physics_potentialdamage_p={{{1,15},{10,35},{11,37}}},
		lifemax_p={{{1,35},{10,50},{11,52}}},
		state_zhican_resistrate={{{1,35},{10,150},{11,162}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tw_bwnh = --霸王怒吼--30级主动4--15级
    { 
		attack_usebasedamage_p={{{1,180},{15,210},{16,212},{21,280}}},
		attack_metaldamage_v={
			[1]={{1,300*1},{15,450*0.95},{16,460*0.95},{21,600*0.95}},
			[3]={{1,300*1},{15,450*1.05},{16,460*1.05},{21,600*1.05}}
			},
		state_hurt_attack={{{1,50},{15,100},{16,100},{21,100}},{{1,15*0.5},{15,15*2},{16,15*2},{21,15*2}}},
		state_npcknock_attack={100,7,80},	
		spe_knock_param={6 , 4, 9},
		skill_mintimepercast_v={{{1,20*15},{15,15*15},{16,15*15},{21,15*15}}},
		missile_hitcount={{{1,6},{15,6},{16,6},{21,6}}},
    },
    tw_yjdq = --一骑当千-40级被动2--10级
    {
		add_mult_proc_sate1={225,{{1,6},{10,6},{11,6}},60},  --技能ID,叠加层数，自身为圆心格子半径
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_000={225},
    },
    tw_yjdq_child = --一骑当千_子--10级
    {
		skill_mult_relation={1}, --对应的NPC类型，从skillsetting.ini上查看
		all_series_resist_p={{{1,20},{10,60},{11,64}}},
		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},		
    },
    tw_gjcf = --高级锤法-50级被动3--10级
    {
		add_skill_level={201,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={202,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={203,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={204,{{1,1},{10,10},{11,11}},0},
		userdesc_000={230},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tw_gjcf_child = --高级锤法_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    { 
		attack_attackrate_v={{{1,6},{10,60},{11,66}}},
		attack_usebasedamage_p={{{1,3},{10,30},{11,34}}},
		attack_metaldamage_v={
			[1]={{1,12*1},{10,120},{11,135}},
			[3]={{1,12*1},{10,120},{11,135}}
			},
    }, 
    tw_jlpt = --惊雷破天-60级被动4--10级
    { 
		autoskill={22,{{1,1},{10,10},{11,11}}},
		userdesc_000={241},	
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tw_jlpt_child = --惊雷破天_子
    {
		physics_potentialdamage_p={{{1,10},{10,35},{11,38}}},
		superposemagic={{{1,3},{10,6},{11,6}}},				--叠加层数
		skill_statetime={{{1,15*10},{10,15*10},{11,15*10}}},
    },
    tw_pfcz = --破釜沉舟-70级被动5--10级
    {
		autoskill={21,{{1,1},{10,10},{11,11}}},
		userdesc_000={219},
		userdesc_101={{{1,40},{10,90},{11,95}}},			--描述用，实际触发几率请查看autoskill.tab中的破釜沉舟
		userdesc_102={{{1,15*30},{10,15*30},{11,15*30}}},	--描述用，实际触发间隔请查看autoskill.tab中的破釜沉舟
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tw_pfcz_child  = --破釜沉舟_子--10级
    {
		invincible_b={1,1},
	 	recover_life_p={{{1,1},{10,3},{11,3}},15},
		skill_statetime={{{1,15*2},{10,15*6},{11,15*6}}},
    },
    tw_twbs = --天王本生-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,10},{20,30},{21,31}}},
		lifemax_p={{{1,5},{20,25},{21,26}}},
		attackspeed_v={{{1,10},{20,20},{21,21}}},
		state_hurt_attackrate={{{1,80},{20,200},{21,206}}},
		skill_statetime={{{1,-1},{20,-1},{21,-1}}},
    },
    tw_90_qgbh = --气盖八荒-90级被动7（光环）--10级
    { 
	--	lifemax_p={{{1,20},{10,50},{11,53}}},
		lifemax_v={{{1,1200},{10,4800},{11,5000}}},
		userdesc_101={{{1,20},{10,50},{11,53}}},					--增加队友光环的描述
		userdesc_102={{{1,1000},{10,4000},{11,4500}}},				--增加队友光环的描述
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },	
    tw_90_qgbh_team = --气盖八荒_队友--10级
    { 
	--	lifemax_p={{{1,20},{10,50},{11,53}}},
		lifemax_v={{{1,1000},{10,4000},{11,4300}}},
		skill_statetime={{{1,15*3},{10,15*3},{11,15*3}}},
    },
    tw_ryshs = --日月山河碎-怒气
    { 
		userdesc_000={0},	
    },
    tw_ryshs_child1 = --日月山河碎_子1
    { 
		attack_usebasedamage_p={{{1,1000},{30,500}}},
		attack_metaldamage_v={
			[1]={{1,100*0.9},{30,2000*0.9},{31,2000*0.9}},
			[3]={{1,100*1.1},{30,2000*1.1},{31,2000*1.1}}
			},
    },
	tw_ryshs_child2 = --日月山河碎_子2
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,15*4},{30,15*4}}},
    },	
    tw_lbsh = --力拔山河（废弃技能）
    { 
		attack_usebasedamage_p={{{1,340},{30,400}}},
		attack_metaldamage_v={
			[1]={{1,700*0.9},{30,1000*0.9}},
			[3]={{1,700*1.1},{30,1000*1.1}}
			},
		state_drag_attack={{{1,100},{30,100}},8,90},
		skill_drag_npclen={100},
    },
    tw_lbsh_child = --力拔山河_子（废弃技能）
    { 
	---	state_drag_attack={{{1,100},{30,100}},3,30},
    },
}

FightSkill:AddMagicData(tb)