
local tb    = {
    tr_pg1 = --天忍刺杀术1--普攻1式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,50},{20,80},{30,110},{32,120}}},
		attack_firedamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,270*0.95},{32,294*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,270*1.05},{32,294*1.05}}
			},
		state_palsy_attack={{{1,30},{20,30},{30,30},{32,30}},{{1,4},{20,4},{30,4},{32,4}}},
		state_npcknock_attack={100,7,20},	
		spe_knock_param={6 , 4, 9},
    }, 
    tr_pg2 = --天忍刺杀术2--普攻2式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,50},{20,80},{30,110},{32,120}}},
		attack_firedamage_v={
			[1]={{1,30*1},{20,150*0.95},{30,270*0.95},{32,294*0.95}},
			[3]={{1,30*1},{20,150*1.05},{30,270*1.05},{32,294*1.05}}
			},
		state_palsy_attack={{{1,40},{20,40},{30,40},{32,40}},{{1,4},{20,4},{30,4},{32,4}}},
		state_npcknock_attack={100,7,40},	
		spe_knock_param={6 , 4, 9},
    }, 	
    tr_pg3 = --天忍刺杀术3--普攻3式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,55},{20,85},{30,115},{32,125}}},
		attack_firedamage_v={
			[1]={{1,80*1},{20,200*0.95},{30,320*0.95},{32,344*0.95}},
			[3]={{1,80*1},{20,200*1.05},{30,320*1.05},{32,344*1.05}}
			},
		state_palsy_attack={{{1,60},{20,60},{30,60},{32,60}},{{1,6},{20,6},{30,6},{32,6}}},		
		state_npcknock_attack={100,7,45},
		spe_knock_param={6 , 4, 9},
    }, 	
    tr_pg4 = --天忍刺杀术4--普攻4式--20级
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,100}}},
		attack_usebasedamage_p={{{1,80},{20,150},{30,180},{32,190}}},
		attack_firedamage_v={
			[1]={{1,90*1},{20,350*0.95},{30,470*0.95},{32,494*0.95}},
			[3]={{1,90*1},{20,350*1.05},{30,470*1.05},{32,494*1.05}}
			},
		state_palsy_attack={{{1,100},{20,100},{30,100},{32,100}},{{1,6},{20,6},{30,6},{32,6}}},		
		state_npcknock_attack={100,14,35},
		spe_knock_param={11 , 4, 26},
    }, 
    tr_myzt = --魔焰在天-1级主动1--10级
    { 
		userdesc_000={707},			
		keephide={},
		ms_one_hit_count = {1},				--每次攻击最大数量
		ms_hit_finish_vanish={},			--击中完后子弹就消失
		ms_vanish_remove_buff={706},		--子弹消失后，清掉BUFF
		missile_hitcount={0,0,6},
		skill_mintimepercast_v={{{1,25*15},{15,20*15},{16,20*15},{21,20*15}}},
    }, 
    tr_myzt_child2 = --魔焰在天_子2--10级
    { 
		attack_usebasedamage_p={{{1,50},{15,100},{16,110},{21,160}}},
		attack_firedamage_v={
			[1]={{1,50*1},{15,100*0.95},{16,120*0.95},{21,220*0.95}},
			[3]={{1,50*1},{15,100*1.05},{16,120*1.05},{21,220*1.05}}
			},
		state_npchurt_attack={100,10}, 
		state_burn_attack={{{1,10},{15,30},{16,32},{21,42}},{{1,15*5},{15,15*5},{16,15*5},{21,15*5}},10},  	--概率，持续时间，叠加百分比
		runspeed_p={{{1,-10},{15,-40},{16,-42},{21,-42}}},
		state_palsy_attack={0,15*1},														--配合中级秘籍的技能
		skill_statetime={{{1,15*5},{15,15*5},{16,15*5},{21,15*5}}},		
		missile_hitcount={{{1,1},{15,1},{16,1},{21,1}},{{1,1},{15,1},{16,1},{21,1}}}, 	
    }, 
    tr_swhx = --死亡回旋-4级主动2--10级
    { 
		userdesc_000={709},	
		skill_mintimepercast_v={{{1,20*15},{15,15*15},{16,15*15},{21,15*15}}},
    }, 
    tr_swhx_child = --死亡回旋_子--10级
    { 
		attack_usebasedamage_p={{{1,180},{15,240},{16,250},{21,300}}},
		attack_firedamage_v={
			[1]={{1,200*1},{15,400*0.95},{16,450*0.95},{21,700*0.95}},
			[3]={{1,200*1},{15,400*1.05},{16,450*1.05},{21,700*1.05}}
			},
		state_npchurt_attack={100,15}, 
		state_palsy_attack={0,0},								--配合秘籍所用
	--	state_npcknock_attack={100,7,80},	
	--	spe_knock_param={6 , 4, 9},
    }, 
    tr_xyzy = --血月之影-10级主动3--15级
    { 
		keephide={},
		runspeed_v={{{1,100},{15,200},{16,207},{21,242}}},
		hide={{{1,15*15},{15,15*20},{16,15*20},{21,15*20}},1},				--参数1时间，参数2：队友1，同阵营2
		autoskill={71,{{1,1},{15,15},{16,16},{21,21}}},	
		userdesc_000={713},			
		userdesc_104={{{1,15*15},{15,15*20},{16,15*20},{21,15*20}}},		
		skill_statetime={{{1,15*15},{15,15*20},{16,15*20},{21,15*20}}},
    }, 
    tr_xyzy_child1 = --血月之影_破隐普攻加成buff--15级
    { 
		ignore_defense_v={{{1,500},{15,1200},{16,1400},{21,2400}}},
		attackspeed_v={{{1,50},{15,100},{16,104},{21,124}}},
		deadlystrike_v={{{1,5000},{15,15000},{16,15714},{21,19000}}},
		physics_potentialdamage_p={{{1,30},{15,60},{16,62},{21,72}}},
		link_skill_buff={},				--连招内保持当前加成BUFF的魔法属性
		addaction_event1={701,714},		--技能701被714替换
		addaction_event2={702,715},		--技能702被715替换
		addaction_event3={703,716},		--技能703被716替换
		addaction_event4={704,717},		--技能704被717替换
		skill_statetime={{{1,15*4},{15,15*4},{16,15*4},{21,15*4}}},
    },
    tr_xyzy_gongji1 = --血月之影_攻击1--20级（与普攻等级走）
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,120}}},
		attack_usebasedamage_p={{{1,80},{20,80},{30,110},{32,116}}},
		attack_firedamage_v={
			[1]={{1,150*1},{20,150*0.95},{30,270*0.95},{32,294*0.95}},
			[3]={{1,150*1},{20,150*1.05},{30,270*1.05},{32,294*1.05}}
			},
		state_palsy_attack={{{1,30},{20,30},{30,30},{32,30}},{{1,4},{20,4},{30,4},{32,4}}},
		state_npcknock_attack={100,7,20},	
		spe_knock_param={6 , 4, 9},
    }, 
    tr_xyzy_gongji2 = --血月之影_攻击2--20级（与普攻等级走）
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,120}}},
		attack_usebasedamage_p={{{1,80},{20,80},{30,110},{32,116}}},
		attack_firedamage_v={
			[1]={{1,150*1},{15,150*0.95},{30,270*0.95},{32,294*0.95}},
			[3]={{1,150*1},{15,150*1.05},{30,270*1.05},{32,294*1.05}}
			},
		state_palsy_attack={{{1,50},{20,50},{30,50},{32,50}},{{1,4},{20,4},{30,4},{32,4}}},
		state_npcknock_attack={100,7,80},	
		spe_knock_param={6 , 4, 9},

    }, 	
    tr_xyzy_gongji3 = --血月之影_攻击3--20级（与普攻等级走）
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,120}}},
		attack_usebasedamage_p={{{1,85},{20,85},{30,115},{32,121}}},
		attack_firedamage_v={
			[1]={{1,200*1},{20,200*0.95},{30,320*0.95},{32,344*0.95}},
			[3]={{1,200*1},{20,200*1.05},{30,320*1.05},{32,344*1.05}}
			},
		state_palsy_attack={{{1,80},{20,80},{30,80},{32,80}},{{1,6},{20,6},{30,6},{32,6}}},
		
		state_npcknock_attack={100,7,90},
		spe_knock_param={6 , 4, 9},

	
    }, 	
    tr_xyzy_gongji4 = --血月之影_攻击4--20级（与普攻等级走）
    { 
		attack_attackrate_v={{{1,100},{20,100},{30,100},{32,120}}},
		attack_usebasedamage_p={{{1,155},{20,155},{30,185},{32,185}}},
		attack_firedamage_v={
			[1]={{1,350*1},{20,350*0.95},{30,470*0.95},{32,494*0.95}},
			[3]={{1,350*1},{20,350*1.05},{30,470*1.05},{32,494*1.05}}
			},
		state_palsy_attack={{{1,100},{20,100},{30,100},{32,100}},{{1,6},{20,6},{30,6},{32,6}}},
		
		state_npcknock_attack={100,14,80},
		spe_knock_param={11 , 4, 26},

    },	
    tr_hyfh = --幻影飞狐-20级被动1--10级
    { 
		physics_potentialdamage_p={{{1,35},{10,50},{11,52}}},
		deadlystrike_p={{{1,50},{10,100},{11,105}}},
		npc_ext_miss={{{1,50},{10,400},{11,435}}},			--增加对NPC闪避值
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tr_shlx = --摄魂乱心-30级主动4--15级
    { 
		userdesc_000={723},	
		skill_mintimepercast_v={{{1,40*15},{15,35*15},{16,35*15},{21,35*15}}},
    }, 	
    tr_shlx_child = --摄魂乱心_子--15级
    { 
		attack_usebasedamage_p={{{1,120},{15,160},{16,170},{21,220}}},
		attack_firedamage_v={
			[1]={{1,100*1},{15,400*0.95},{16,420*0.95},{21,520*0.95}},
			[3]={{1,100*1},{15,400*1.05},{16,420*1.05},{21,520*1.05}}
			},
		state_confuse_attack={{{1,15},{15,30},{16,31},{21,36}},{{1,15*1.5},{15,15*1.5},{16,15*1.5},{21,15*1.5}}},	
		state_drag_attack={{{1,30},{15,40},{16,40},{21,40}},8,30},		
		skill_drag_npclen={0},
		state_npchurt_attack={100,10}, 
		state_nojump_attack={{{1,60},{15,60},{16,60},{21,60}},{{1,15*1},{15,15*1},{16,15*1},{21,15*1}}},		
		missile_hitcount={{{1,6},{15,6},{16,6},{21,6}}},
    }, 
    tr_myqs = --魔焰七杀-40级被动2--10级
    { 
		autoskill={76,{{1,1},{10,10},{11,11}}},
		userdesc_000={743},	
		userdesc_101={{{1,50},{10,100},{11,105}}},		 --假的魔法属性，数值要与tr_myqs_child2的闪避一样
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
    },
    tr_myqs_child1 = --魔焰七杀-控制层数--10级
    {
		all_series_resist_p={{{1,-10},{10,-30},{11,-32}}},		--减抗
		superposemagic={{{1,6},{10,8},{11,8}}},					--叠加层数
		skill_statetime={{{1,15*6},{10,15*6},{11,15*6}}},
    },
    tr_myqs_child2 = --魔焰七杀-自身BUFF
    {
		defense_v={{{1,50},{10,100},{11,105}}},
		superposemagic={{{1,6},{10,8},{11,8}}},
		skill_statetime={{{1,15*6},{10,15*6},{11,15*6}}},
    },
    tr_gjcss = --高级刺杀术-50级被动3--10级
    { 
		add_skill_level={701,{{1,1},{10,10},{11,11}},0},
		add_skill_level2={702,{{1,1},{10,10},{11,11}},0},
		add_skill_level3={703,{{1,1},{10,10},{11,11}},0},
		add_skill_level4={704,{{1,1},{10,10},{11,11}},0},
		userdesc_000={729},	
		deadlystrike_damage_p={{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},		
    },
    tr_gjcss_child = --高级刺杀术_子（仅用作显示，无实际效果加成。实际效果查看普攻的21-30级）--10级
    { 
		attack_usebasedamage_p={{{1,3},{10,30},{11,33}}},
		attack_firedamage_v={
			[1]={{1,12},{10,120},{11,132}},
			[3]={{1,12},{10,120},{11,132}}
			},
		deadlystrike_damage_p={{{1,1},{10,10},{11,11}}},		
    },
    tr_psxk = --破碎虚空-60级被动4--10级
    { 
		autoskill={77,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_101={{{1,15*5},{10,15*15},{11,15*16}}},			--描述用，tr_psxk_child2 减CD数值
		userdesc_000={746},	
    },
    tr_psxk_child1 = --破碎虚空_减血月
    { 
		reduce_cd_time={711,{{1,15*5},{10,15*20},{11,15*21}}},
		skill_statetime={{{1,1},{10,1},{11,1}}},		
    },
    tr_psxk_child2 = --破碎虚空_减魔焰
    { 
		reduce_cd_time={705,{{1,15*5},{10,15*15},{11,15*16}}},
		skill_statetime={{{1,1},{10,1},{11,1}}},		
    },
    tr_shfx = --圣火焚心-70级被动7--10级
    { 
		autoskill={73,{{1,1},{10,10},{11,11}}},
		skill_statetime={{{1,-1},{10,-1},{11,-1}}},
		userdesc_101={{{1,40},{10,90},{11,95}}},		 --描述用，实际触发几率请查看autoskill.tab中的圣火焚心
		userdesc_000={737},	
    },
    tr_shfx_child = --圣火焚心_子--10级
    { 
		defense_p={{{1,100},{10,500},{11,550}}},
		runspeed_v={{{1,20},{10,60},{11,65}}},
		physics_potentialdamage_p={{{1,50},{10,200},{11,220}}},
		deadlystrike_p={{{1,50},{10,200},{11,220}}},
		skill_statetime={{{1,15*5},{10,15*10},{11,15*10}}},
    },
    tr_tmjt = --天魔解体-80级被动6--20级
    {
		physics_potentialdamage_p={{{1,16},{20,50},{21,55}}},
		lifemax_p={{{1,15},{20,40},{21,45}}},
		attackspeed_v={{{1,5},{20,20},{21,21}}},
		state_palsy_attackrate={{{1,35},{20,200},{21,220}}},
		skill_statetime={{{1,-1},{20,-1},{21,-1}}},
    },
     tr_90_fhwj = --飞鸿无迹
    {  
		autoskill={78,{{1,1},{10,10},{11,11}}},
		userdesc_000={771},
		userdesc_101={{{1,15*6},{10,15*3},{11,15*3}}},			--描述用，触发间隔时间，实际效果查看autoskill.tab中的飞鸿无迹
		skill_statetime={{{1,-1},{10,-1}}},		
    },
    tr_90_fhwj_child = --飞鸿无迹_子
    { 
		rand_ignoreskill={{{1,50},{10,80},{11,85}},1,1},		--概率，数量，类型（skillsetting下定义类型）
		missile_hitcount={0,0,1}, 
    },
    tr_qmyhs = --千魔影幻杀-怒气
    { 
		attack_usebasedamage_p={{{1,1000},{10,800}}},
		attack_firedamage_v={
			[1]={{1,300*0.9},{10,200*0.9},{31,200*0.9}},
			[3]={{1,300*1.1},{10,200*1.1},{31,200*1.1}}
			},		
    },
    tr_qmyhs_child = --千魔影幻杀_子
    { 
		ignore_series_state={},		--免疫属性效果
		ignore_abnor_state={},		--免疫负面效果
		skill_statetime={{{1,30},{10,30}}},
    },
    old_tr_myqs = --魔焰七杀-40级被动2--10级
    { 
		autoskill={72,{{1,1},{10,10},{31,10}}},
		userdesc_000={726},			
		skill_statetime={{{1,-1},{10,-1}}},
    },
    old_tr_myqs_child = --魔焰七杀_子2--10级
    { 
		attack_lastnpc_usedmg_p={{{1,100},{10,200}}},			--最后击杀时取对方攻击力的百分比
		state_burn_attack={{{1,100},{10,100}},{{1,15*5},{10,15*5}},10},  --概率，持续时间，叠加百分比
    }, 	
}

FightSkill:AddMagicData(tb)